[
  {
    "id": "HH_1",
    "messages": [
      {
        "role": "human1",
        "content": "Remember three weeks ago when we saw a movie?"
      },
      {
        "role": "human2",
        "content": "yes with the cool 3D glasses"
      },
      {
        "role": "human1",
        "content": "yes and it looked so real that you fell off your chair"
      },
      {
        "role": "human2",
        "content": "yes and I broke my neck in 4 places"
      },
      {
        "role": "human1",
        "content": "yes and the doctors built you back as a robot - stronger than ever before"
      },
      {
        "role": "human2",
        "content": "yes! and they made my arms from dragon metal"
      },
      {
        "role": "human1",
        "content": "yes and we used your strength to rob a bank"
      },
      {
        "role": "human2",
        "content": "yes and got inside this bank"
      },
      {
        "role": "human1",
        "content": "yes and we found all the rare diamonds, jewellery and a secret treasure map"
      },
      {
        "role": "human2",
        "content": "yes! and I remember how you recognized the diamonds, it was like you had super vision"
      },
      {
        "role": "human1",
        "content": "yes! Those are were the diamonds I bought my wife 12 years before"
      },
      {
        "role": "human2",
        "content": "yes and your wife ate them at the first day in your honeymoon"
      },
      {
        "role": "human1",
        "content": "yes and that's when I filed for divorce"
      },
      {
        "role": "human2",
        "content": "yes and it was so sad when she put those expensive diamonds in her stomach"
      },
      {
        "role": "human1",
        "content": "yes so when we saw the diamonds in the bank we went back home for a cup of tea and television"
      },
      {
        "role": "human2",
        "content": "yes and started to celebrate our first accomplishment with my new robot arms"
      },
      {
        "role": "human1",
        "content": "yes and we high fived - and because of your strength my hands exploaded"
      },
      {
        "role": "human2",
        "content": "yes and we called the same doctor, so he will give you super arms also"
      },
      {
        "role": "human1",
        "content": "yes and I got married to the doctor"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 20,
    "num_words": 227
  },
  {
    "id": "HH_2",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we were at the sea?"
      },
      {
        "role": "human2",
        "content": "Yes, and we took the lifeguard's boat"
      },
      {
        "role": "human1",
        "content": "Yes, and after taking the boat for a spin we took it home"
      },
      {
        "role": "human2",
        "content": "Yes, and at home a king's meal was waiting for us that my sister prepared for us"
      },
      {
        "role": "human1",
        "content": "Yes, and we ate it on a table made of the boat"
      },
      {
        "role": "human2",
        "content": "Yes it was great, then you got on the table and started roaming the kitchen"
      },
      {
        "role": "human1",
        "content": "Yes, and suddenly the house was filled with lava, so you went up on the boat as well"
      },
      {
        "role": "human2",
        "content": "Yeah... and then we grabbed paddles made of bread and started catching lava waves"
      },
      {
        "role": "human1",
        "content": "Yes and we managed to catch one wave all the way to the grocery store"
      },
      {
        "role": "human2",
        "content": "Yes, and then at the grocery store we met the King of Fire who is the one who controls the movement of the lava"
      },
      {
        "role": "human1",
        "content": "Yes and we liked his daughter"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 150
  },
  {
    "id": "HH_3",
    "messages": [
      {
        "role": "human1",
        "content": "Hey"
      },
      {
        "role": "human2",
        "content": "Hi"
      },
      {
        "role": "human1",
        "content": "One Friday we were at Idan's"
      },
      {
        "role": "human2",
        "content": "Yes and we ordered hamburgers"
      },
      {
        "role": "human1",
        "content": "Yes and there were many good additions"
      },
      {
        "role": "human2",
        "content": "Yes and then Dor brought a huge sword"
      },
      {
        "role": "human1",
        "content": "Yes, and Idan decided it was a good idea to play with it"
      },
      {
        "role": "human2",
        "content": "Yes, and we thought it was better to get him away before he became too dangerous"
      },
      {
        "role": "human1",
        "content": "Yes, and we remembered all the times that Idan was cut from shelves and leaves"
      },
      {
        "role": "human2",
        "content": "Yes, and that's why we decided it's better to sit somewhere else"
      },
      {
        "role": "human1",
        "content": "Yes, and we tried to think where it would be best to sit"
      },
      {
        "role": "human2",
        "content": "Yes and then we found a very beautiful forest"
      },
      {
        "role": "human1",
        "content": "Yes, and then we ate some mushroom we found on the ground"
      },
      {
        "role": "human2",
        "content": "Yes, and then a huge bear came"
      },
      {
        "role": "human1",
        "content": "Yes, and it was a bear that knew how to juggle"
      },
      {
        "role": "human2",
        "content": "Yes and we thought of giving him a mushroom to neutralise him"
      },
      {
        "role": "human1",
        "content": "Yes, because we remembered that it's a bear that likes to eat"
      },
      {
        "role": "human2",
        "content": "Yes and he is also a vegetarian"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 19,
    "num_words": 168
  },
  {
    "id": "HH_4",
    "messages": [
      {
        "role": "human1",
        "content": "Last year we flew to the Philippines"
      },
      {
        "role": "human2",
        "content": "Yes, and we almost missed the flight"
      },
      {
        "role": "human1",
        "content": "Yes, because the taxi driver got stuck in the car five minutes before we arrived in airport"
      },
      {
        "role": "human2",
        "content": "Yes, because he couldn't get your luggage into the car"
      },
      {
        "role": "human1",
        "content": "Yes, because I took a spare one for all the shopping, like you taught me"
      },
      {
        "role": "human2",
        "content": "Yes, it was really worth it because there was a crazy mall there"
      },
      {
        "role": "human1",
        "content": "Yes, and there were also the most beautiful beaches I've ever seen"
      },
      {
        "role": "human2",
        "content": "Yes and the water is so clear"
      },
      {
        "role": "human1",
        "content": "Yes, and there were plenty of fish that we kept diving"
      },
      {
        "role": "human2",
        "content": "Yes, and the fish touched us and it gave you a rash"
      },
      {
        "role": "human1",
        "content": "Yes, and we walked around for hours looking for a pharmacy"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 123
  },
  {
    "id": "HH_5",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we were at the zoo?"
      },
      {
        "role": "human2",
        "content": "Yes, and we went to the wedding of a pair of giraffes"
      },
      {
        "role": "human1",
        "content": "Yes, and then you decided you were taking the giraffe to the bar"
      },
      {
        "role": "human2",
        "content": "Yes and we drank shots until morning"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 5,
    "num_words": 41
  },
  {
    "id": "HH_6",
    "messages": [
      {
        "role": "human1",
        "content": "Do you remember when we were in Halkhar?"
      },
      {
        "role": "human2",
        "content": "Yes and there was no one there! The whole surface was ours"
      },
      {
        "role": "human1",
        "content": "Yes, and then we did a hand endurance competition there"
      },
      {
        "role": "human2",
        "content": "Yeah and then your hands got stuck to the ice and you couldn't get them free"
      },
      {
        "role": "human1",
        "content": "Yes, and then you came and poured hot water on me to free me"
      },
      {
        "role": "human2",
        "content": "Yes and then all the ice melted and became a lake"
      },
      {
        "role": "human1",
        "content": "Yes and then we went water skiing there"
      },
      {
        "role": "human2",
        "content": "Yes, and it would be crazy that you found a jet ski there and linked me to it"
      },
      {
        "role": "human1",
        "content": "Yes, and the jet ski was full of beer and we didn't understand why"
      },
      {
        "role": "human2",
        "content": "Yes, and then we realised that it was its fuel and it was driving on beer, it's a new patent"
      },
      {
        "role": "human1",
        "content": "Yes, and then we put a hose in a gas tank and drank"
      },
      {
        "role": "human2",
        "content": "Yes, and then we got stuck in the middle of the lake and we would have no way to get back"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 166
  },
  {
    "id": "HH_7",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we went for a run in the snow?"
      },
      {
        "role": "human2",
        "content": "Yes, and we passed by the music hall"
      },
      {
        "role": "human1",
        "content": "Yes, and then we heard a performance of a tribute to arctic monkeys"
      },
      {
        "role": "human2",
        "content": "Yes, and then we remembered those monkeys from the movie we once saw"
      },
      {
        "role": "human1",
        "content": "Yes, and then we started climbing the trees that were next to us"
      },
      {
        "role": "human2",
        "content": "Yes and we found bananas that tasted like caramel"
      },
      {
        "role": "human1",
        "content": "Yes, and then we picked them all and sold them for 100$ per kilo"
      },
      {
        "role": "human2",
        "content": "Yes and we made so much money we went to England and met Ringo Starr"
      },
      {
        "role": "human1",
        "content": "Yes and then he invited us to be his accompanists on his tour"
      },
      {
        "role": "human2",
        "content": "Yes, and then we slept at his house and found ourselves in the most comfortable bed in the world"
      },
      {
        "role": "human1",
        "content": "Yes and then when we got up in the morning we found out that it was us and Paul McCartney all sleeping together"
      },
      {
        "role": "human2",
        "content": "fun :)"
      },
      {
        "role": "human1",
        "content": "<3"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 154
  },
  {
    "id": "HH_8",
    "messages": [
      {
        "role": "human1",
        "content": "I remember that two years ago we went for a walk"
      },
      {
        "role": "human2",
        "content": "Yes and we caught rides in the desert"
      },
      {
        "role": "human1",
        "content": "Yes and we drank a lot of wine in the process"
      },
      {
        "role": "human2",
        "content": "Yes, and a hippie truck driver stopped us"
      },
      {
        "role": "human1",
        "content": "Yes and because he was drunk so I drove in his place"
      },
      {
        "role": "human2",
        "content": "Yes, and then we saw a lot of shooting stars"
      },
      {
        "role": "human1",
        "content": "Yes and then it started to rain"
      },
      {
        "role": "human2",
        "content": "Yes, then there was a shower of meteors and rain in general and we didn't really know what to do because we were all drunk. We decided not to stop and drive really fast."
      },
      {
        "role": "human1",
        "content": "Yes, and we wanted to make it to the concert that was there"
      },
      {
        "role": "human2",
        "content": "That's right and we arrived at the very last minute and somehow managed to get backstage and met the band."
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 135
  },
  {
    "id": "HH_9",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last Passover we were in quarantine?"
      },
      {
        "role": "human2",
        "content": "We were in the north last Passover and we travelled"
      },
      {
        "role": "human1",
        "content": "Yes, and there was panic at first and it was forbidden to touch anyone"
      },
      {
        "role": "human2",
        "content": "Yes, and we saw lots of animals in the forest"
      },
      {
        "role": "human1",
        "content": "Yes, and the bike trip we took to the lake was one of the fun ones"
      },
      {
        "role": "human2",
        "content": "Yes, and we climbed a really high mountain"
      },
      {
        "role": "human1",
        "content": "Yes and maybe we should do it again"
      },
      {
        "role": "human2",
        "content": "Yes, and you can also go to Eilat, there are animals there too"
      },
      {
        "role": "human1",
        "content": "Yes and from there we will continue to feel in Sinai"
      },
      {
        "role": "human2",
        "content": "Yes and we will continue to Egypt"
      },
      {
        "role": "human1",
        "content": "Yes, and we land the passport in many cool countries"
      },
      {
        "role": "human2",
        "content": "Yes, and then we will cruise between the countries"
      },
      {
        "role": "human1",
        "content": "Yes, and then maybe we will join the institution as we once thought if we are already there"
      },
      {
        "role": "human2",
        "content": "Yes and we will kill a lot of bad people"
      },
      {
        "role": "human1",
        "content": "Yes, but only bad ones lol and we will be prevented from helping the country"
      },
      {
        "role": "human2",
        "content": "Yes, and we'll make a bungee"
      },
      {
        "role": "human1",
        "content": "Yes and maybe skydiving too"
      },
      {
        "role": "human2",
        "content": "Yes and then we will fly into space"
      },
      {
        "role": "human1",
        "content": "Yes, and then we'll just come back from it in one piece, not like Genesis"
      },
      {
        "role": "human2",
        "content": "Yeah that would be nice haha"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 21,
    "num_words": 207
  },
  {
    "id": "HH_10",
    "messages": [
      {
        "role": "human1",
        "content": "What's going on? Remember we met two weeks ago?"
      },
      {
        "role": "human2",
        "content": "Hello"
      },
      {
        "role": "human1",
        "content": "Yes and we went to the sea to help a popsicle seller"
      },
      {
        "role": "human2",
        "content": "Yes and in return he gave each of us 4 cassettes and two icicles"
      },
      {
        "role": "human1",
        "content": "Yeah and then we decided it wasn't worth it enough and we'd never help him again"
      },
      {
        "role": "human2",
        "content": "Yes, and then he got offended, said he was resigning and said it was our responsibility to sell popsicles to all the bathers at the beach"
      },
      {
        "role": "human1",
        "content": "Yes, and then we decided to open a tent and move to live on the beach"
      },
      {
        "role": "human2",
        "content": "Yes and since then we have been raising 4 sea turtle eggs and a jellyfish"
      },
      {
        "role": "human1",
        "content": "Yes, and yesterday the jellyfish decided to eat all of our sea turtles"
      },
      {
        "role": "human2",
        "content": "Yes, and then we decided to stop sleeping on the beach and moved to the city"
      },
      {
        "role": "human1",
        "content": "Yes and at the end came a zombie attack that destroyed the whole city"
      },
      {
        "role": "human2",
        "content": "Yes, and then we lived happily ever after, as zombies"
      },
      {
        "role": "human1",
        "content": "Yes, and after one year we decided to establish a beach in the new town"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 178
  },
  {
    "id": "HH_11",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we made a youtube channel?"
      },
      {
        "role": "human2",
        "content": "yes and we had two fans"
      },
      {
        "role": "human1",
        "content": "yes and we met the fans in the mall"
      },
      {
        "role": "human2",
        "content": "yes and that was the first time we realised that Ronaldo is our big fan"
      },
      {
        "role": "human1",
        "content": "yes and we asked him if we can be his fans, he said yes and we all flew to Madrid"
      },
      {
        "role": "human2",
        "content": "yes and then we started to get more fans, and even from barcelona"
      },
      {
        "role": "human1",
        "content": "yes and then we had so many fans that we made a cult"
      },
      {
        "role": "human2",
        "content": "yes! that cult on our small rat was one of my favourite"
      },
      {
        "role": "human1",
        "content": "yes and after we had the rat cult we went to work in the rice fields"
      },
      {
        "role": "human2",
        "content": "yes and Ronaldo so loved our rice that he quit from soccer"
      },
      {
        "role": "human1",
        "content": "yes and we took his position in the team and became the biggest soccer players ever"
      },
      {
        "role": "human2",
        "content": "yes and we made our rat to be Madrid's coach"
      },
      {
        "role": "human1",
        "content": "yes and people really enjoyed his fresh view point on the sport, and soccer became an even bigger sport - making us even more famous, so now we had 3 fans"
      },
      {
        "role": "human2",
        "content": "yes and every fan gave us a 1 million dollar donation"
      },
      {
        "role": "human1",
        "content": "yes and we used the money to buy pizza"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 201
  },
  {
    "id": "HH_12",
    "messages": [
      {
        "role": "human1",
        "content": "I start..."
      },
      {
        "role": "human2",
        "content": "Like I started in our bowling game"
      },
      {
        "role": "human1",
        "content": "Yes, and it was really fun. We went to the restaurant afterwards"
      },
      {
        "role": "human2",
        "content": "True, it was romantic that day"
      },
      {
        "role": "human1",
        "content": "Yes and we ordered pasta"
      },
      {
        "role": "human2",
        "content": "And we pulled her from side to side with our mouths until the waiter grabbed her with his mouth!"
      },
      {
        "role": "human1",
        "content": "Yes and we started fighting with him"
      },
      {
        "role": "human2",
        "content": "Yes, he punched me like that"
      },
      {
        "role": "human1",
        "content": "It wasn't fun"
      },
      {
        "role": "human2",
        "content": "Yes, and then we went to the hospital"
      },
      {
        "role": "human1",
        "content": "It's true, I forgot about it. The doctor was very kind"
      },
      {
        "role": "human2",
        "content": "Then the waiter came to a hospital and continued to beat you"
      },
      {
        "role": "human1",
        "content": "True, and at least there I managed to punch him right in the nose"
      },
      {
        "role": "human2",
        "content": "Yes, and then the restaurant bill brought us a compensation ofâ€¦"
      },
      {
        "role": "human1",
        "content": "husband*"
      },
      {
        "role": "human2",
        "content": "Yes compensation of a pizza tray and a flight to Rhodes"
      },
      {
        "role": "human1",
        "content": "Wow, what fun it was in Rhodes!! We swam with dolphins"
      },
      {
        "role": "human2",
        "content": "True, and with bears that swam"
      },
      {
        "role": "human1",
        "content": "The bears are cute"
      },
      {
        "role": "human2",
        "content": "Really cute!"
      },
      {
        "role": "human1",
        "content": "Until one of them wanted to eat my leg"
      },
      {
        "role": "human2",
        "content": "Lucky that jellyfish got caught on his head and he didn't have time to give you a bite"
      },
      {
        "role": "human1",
        "content": "Everything was fun, maybe we'll go back there againðŸ˜Š"
      },
      {
        "role": "human2",
        "content": "amount*"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 25,
    "num_words": 196
  },
  {
    "id": "HH_13",
    "messages": [
      {
        "role": "human1",
        "content": "CAT"
      },
      {
        "role": "human2",
        "content": "CAT"
      },
      {
        "role": "human1",
        "content": "Yes"
      },
      {
        "role": "human2",
        "content": "i am a cat"
      },
      {
        "role": "human1",
        "content": "yes and i am a dog"
      },
      {
        "role": "human2",
        "content": "Yes and I want to go on a trip"
      },
      {
        "role": "human1",
        "content": "Yes, and you can go to Panama"
      },
      {
        "role": "human2",
        "content": "Yes and also to Costa Rica"
      },
      {
        "role": "human1",
        "content": "Yes, and then you can take a flight to space"
      },
      {
        "role": "human2",
        "content": "Yes, and then we will also get drunk there"
      },
      {
        "role": "human1",
        "content": "Yes and then we'll stop for milk to get rid of the hangover"
      },
      {
        "role": "human2",
        "content": "Yes, and then we'll drink more"
      },
      {
        "role": "human1",
        "content": "Yes, and then we'll fly to a private aftermarket on Mars"
      },
      {
        "role": "human2",
        "content": "Yes and then we will skydive to earth"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 93
  },
  {
    "id": "HH_14",
    "messages": [
      {
        "role": "human1",
        "content": "starting up?"
      },
      {
        "role": "human2",
        "content": "I remember we had a toast party yesterday"
      },
      {
        "role": "human1",
        "content": "Yes, and you threw up all evening, the cheese was spoiled"
      },
      {
        "role": "human2",
        "content": "Yes, and someone's grandmother skateboarded indoors"
      },
      {
        "role": "human1",
        "content": "Yes, and then we took her to the ER and found out she was pregnant"
      },
      {
        "role": "human2",
        "content": "Yes and we tried to get the baby out ourselves"
      },
      {
        "role": "human1",
        "content": "Yes, and then we found out that she was actually born a koala with 3 eyes"
      },
      {
        "role": "human2",
        "content": "Yes, and then we took the special helicopter to the koala hospital"
      },
      {
        "role": "human1",
        "content": "Yes, and when we arrived in Australia, the helicopter suddenly ran out of fuel and we crashed in a river full of crocodiles"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 104
  },
  {
    "id": "HH_15",
    "messages": [
      {
        "role": "human1",
        "content": "Remember a year and a half ago when we visited the dark side of the moon?"
      },
      {
        "role": "human2",
        "content": "You must remember! I found a really hot pepper there. Do you remember trying it?"
      },
      {
        "role": "human1",
        "content": "Yes, he was so hot that we fueled the spaceship with him and flew back home to New York"
      },
      {
        "role": "human2",
        "content": "Yes, and then when we got to eighty-eighth by two hundred and five avenues we went to the Apple store"
      },
      {
        "role": "human1",
        "content": "Yes, and in the store they admired us so much that they appointed us CEOs of Apple"
      },
      {
        "role": "human2",
        "content": "Then we went to Tim Cook's house and we beat him a little"
      },
      {
        "role": "human1",
        "content": "Yes and he was so impressed with our hitting abilities that he made us CEOs of the planet"
      },
      {
        "role": "human2",
        "content": "Then we decided to turn Earth into a spaceship and flew them all together to the neighboring galaxy"
      },
      {
        "role": "human1",
        "content": "Yes, and we saw that the entire planet is made up of a culture that works on hot peppers"
      },
      {
        "role": "human2",
        "content": "Then we realized that if we return to the moon soon we will be multi-ultra billionaires"
      },
      {
        "role": "human1",
        "content": "Yes and we did that and poured all the money into one pile that was higher than the pyramids in Giza"
      },
      {
        "role": "human2",
        "content": "Then we went to eat shawarma at Gemil"
      },
      {
        "role": "human1",
        "content": "And we lived happily ever after"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 207
  },
  {
    "id": "HH_16",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we visited Superland?"
      },
      {
        "role": "human2",
        "content": "Yes and they didn't let you get on the roller coaster"
      },
      {
        "role": "human1",
        "content": "Yes and I waited in line until the luna park ginny came"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 4,
    "num_words": 30
  },
  {
    "id": "HH_17",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we went to ride horses?"
      },
      {
        "role": "human2",
        "content": "yes and I went on the blue one"
      },
      {
        "role": "human1",
        "content": "yes and you quickly learned how to do flips with the horse"
      },
      {
        "role": "human2",
        "content": "yes and then you started to throw balls at us"
      },
      {
        "role": "human1",
        "content": "yes and one of the balls hit the manager and he kicked us out"
      },
      {
        "role": "human2",
        "content": "yes and outside we saw a dog race"
      },
      {
        "role": "human1",
        "content": "yes and we both wanted to race with the dogs"
      },
      {
        "role": "human2",
        "content": "yes and then you thought that the manager is your racing dog"
      },
      {
        "role": "human1",
        "content": "yes and I decided to ride the manager in the race and we won, with the money from the winnings I got us both a hotdog"
      },
      {
        "role": "human2",
        "content": "yes and I think it was the spiciest hot dog I ever had"
      },
      {
        "role": "human1",
        "content": "yes and it was so spicy that we used it as fuel for our car"
      },
      {
        "role": "human2",
        "content": "yes it was so spicy that our car started to fly"
      },
      {
        "role": "human1",
        "content": "yes and we took the car to Iran, to visit our secret families"
      },
      {
        "role": "human2",
        "content": "yes and then they arrested us"
      },
      {
        "role": "human1",
        "content": "yes and we had to escape prison, luckily we still had some of the hotdog left"
      },
      {
        "role": "human2",
        "content": "yes and we made a trampoline from that hot dog"
      },
      {
        "role": "human1",
        "content": "yes and we landed back home in time to go to sleep"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 204
  },
  {
    "id": "HH_18",
    "messages": [
      {
        "role": "human1",
        "content": "Hey, what's going on? Remember that two years ago we went to San Francisco to see a concert by Pitbull and Jennifer Lopez?"
      },
      {
        "role": "human2",
        "content": "Yes, and suddenly John Lennon and Golda Meir came out on stage"
      },
      {
        "role": "human1",
        "content": "Yes, and then also Mati Caspi and Gaddafi came to give a guitar solo"
      },
      {
        "role": "human2",
        "content": "Yes, and as an encore they sang the song Pouch by Noa Kirel"
      },
      {
        "role": "human1",
        "content": "Yes and then after the show we went to an after party at BeyoncÃ© and Jay Z's mansion"
      },
      {
        "role": "human2",
        "content": "Yes and there was a huge pool the size of a football field"
      },
      {
        "role": "human1",
        "content": "Yes and suddenly everyone decided that they take off their clothes and jump into the water naked"
      },
      {
        "role": "human2",
        "content": "Yes and then someone turned on a wave machine and started surfing with a surfboard in the pool"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 9,
    "num_words": 129
  },
  {
    "id": "HH_19",
    "messages": [
      {
        "role": "human1",
        "content": "Last year I flew to a distant continent and rented a used car"
      },
      {
        "role": "human2",
        "content": "Yes and after two days we met in a tropical town"
      },
      {
        "role": "human1",
        "content": "Yes, and there was a stand of tropical pizza for 5$"
      },
      {
        "role": "human2",
        "content": "Pizza and tropical food!"
      },
      {
        "role": "human1",
        "content": "Yes and after a few minutes we started to vomit our hearts out"
      },
      {
        "role": "human2",
        "content": "Yes, and you didn't let me hold your hair, so it was filled with the remains of digested pizza"
      },
      {
        "role": "human1",
        "content": "Yes, and that's why I shaved half my head off"
      },
      {
        "role": "human2",
        "content": "Yes, and how lucky that the barber didn't cut your ear! It was close"
      },
      {
        "role": "human1",
        "content": "Yes, it's lucky because he only cut my ear lobe"
      },
      {
        "role": "human2",
        "content": "Yes, and then I could no longer lick it for you like you always liked"
      },
      {
        "role": "human1",
        "content": "yes and.."
      },
      {
        "role": "human2",
        "content": "â¤ï¸"
      },
      {
        "role": "human1",
        "content": "ðŸ˜˜"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 125
  },
  {
    "id": "HH_20",
    "messages": [
      {
        "role": "human1",
        "content": "I feel like you know me from before"
      },
      {
        "role": "human2",
        "content": "Remember we were in Florentine two months ago?"
      },
      {
        "role": "human1",
        "content": "Yes and we found ourselves eating pizza there with the strangest toppings"
      },
      {
        "role": "human2",
        "content": "Yes, and then one of the homeless asked us to keep guard on his scooter for him"
      },
      {
        "role": "human1",
        "content": "Yes, and then we sat with the homeless man and shared a pizza with him and we all went out to a new movie"
      },
      {
        "role": "human2",
        "content": "Yes, and then the film was bad and we decided to cut it in the middle"
      },
      {
        "role": "human1",
        "content": "Yes, and then we found ourselves walking towards the Tel Aviv port near the pier"
      },
      {
        "role": "human2",
        "content": "Yes, and then some girls passed by us who were running there without shirts and you fell in love with one of them"
      },
      {
        "role": "human1",
        "content": "Yes, I also remember that she had a really fascinating tattoo, of a map that leads to a cache with a great treasure"
      },
      {
        "role": "human2",
        "content": "Yes and the homeless man wanted him to take us to this treasure"
      },
      {
        "role": "human1",
        "content": "Yes, and then we took the scooter and drove it to the heart of the sea where the treasure was and we encountered a pirate"
      },
      {
        "role": "human2",
        "content": "Yes, and we stopped at the crispy crab"
      },
      {
        "role": "human1",
        "content": "We also ordered a bowl of mussels in Caribbean sauce"
      },
      {
        "role": "human2",
        "content": "Yes and I found a toothpick in the food"
      },
      {
        "role": "human1",
        "content": "Yes and that's how we got all the money back :)"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 223
  },
  {
    "id": "HH_21",
    "messages": [
      {
        "role": "human1",
        "content": "I am sitting in the sea"
      },
      {
        "role": "human2",
        "content": "I see a fairy"
      },
      {
        "role": "human1",
        "content": "Then the fairy split in two"
      },
      {
        "role": "human2",
        "content": "Then a light came out of her"
      },
      {
        "role": "human1",
        "content": "Then she had a lot of pinkies"
      },
      {
        "role": "human2",
        "content": "And full of such rubber"
      },
      {
        "role": "human1",
        "content": "Then the fairy asked us to help her with the experiment"
      },
      {
        "role": "human2",
        "content": "Then I agreed because I am an exemplary friend"
      },
      {
        "role": "human1",
        "content": "Then the fairy lingered and lingered"
      },
      {
        "role": "human2",
        "content": "Then she decided not to waste my time and we didn't"
      },
      {
        "role": "human1",
        "content": "Then we got a prize from the fairy"
      },
      {
        "role": "human2",
        "content": "And the prize was divided into two"
      },
      {
        "role": "human1",
        "content": "Then I returned to the conversation"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 94
  },
  {
    "id": "HH_22",
    "messages": [
      {
        "role": "human1",
        "content": "One day me and Tza went to the sea"
      },
      {
        "role": "human2",
        "content": "Yes, and we sat happily, drinking beers and enjoying ourselves"
      },
      {
        "role": "human1",
        "content": "Yes, and then we met a fat man who sells popsicles"
      },
      {
        "role": "human2",
        "content": "Yes, and then I thought to myself, \"He just won't come talk to us\""
      },
      {
        "role": "human1",
        "content": "Yes, and then he came to talk to us"
      },
      {
        "role": "human2",
        "content": "Yes, and I said to him: \"Listen, honey, leave me alone\""
      },
      {
        "role": "human1",
        "content": "Yes, and then I threw a bunch of jellyfish at him"
      },
      {
        "role": "human2",
        "content": "Yes, and then the lifeguard came with a pee bag in hand"
      },
      {
        "role": "human1",
        "content": "Yes and then the saviour said that only one person in the world can save him"
      },
      {
        "role": "human2",
        "content": "Yes and then out of nowhere he landed from the sky"
      },
      {
        "role": "human1",
        "content": "Yes and it made a huge tsunami"
      },
      {
        "role": "human2",
        "content": "Yes and it was the biggest wave we surfed"
      },
      {
        "role": "human1",
        "content": "Yes and then we drifted back to the beach"
      },
      {
        "role": "human2",
        "content": "Yeah and then we saw the fat popsicle seller again"
      },
      {
        "role": "human1",
        "content": "Yes, and this time we decided to try to be nice and help him carry things"
      },
      {
        "role": "human2",
        "content": "Yes, and then somehow we gave him a piggy-back up the mountain"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 178
  },
  {
    "id": "HH_23",
    "messages": [
      {
        "role": "human1",
        "content": "A month ago we climbed Everest"
      },
      {
        "role": "human2",
        "content": "Yes, and all the snow is melting"
      },
      {
        "role": "human1",
        "content": "Yes and then we inflated our boats and started sailing"
      },
      {
        "role": "human2",
        "content": "Yes, and at the end of the stream we reached the waterfall"
      },
      {
        "role": "human1",
        "content": "Yes and we started screaming in fear"
      },
      {
        "role": "human2",
        "content": "Yes, and then a 669 helicopter arrived"
      },
      {
        "role": "human1",
        "content": "Yes, and we waved our hands and shouted at them"
      },
      {
        "role": "human2",
        "content": "Yes, and from the helicopter came ropes that reached the boat"
      },
      {
        "role": "human1",
        "content": "Yes and we started climbing little by little"
      },
      {
        "role": "human2",
        "content": "Yes, and then we found out that the ropes are actually snakes"
      },
      {
        "role": "human1",
        "content": "Yes and we tried to speak to them in the language of the snakes"
      },
      {
        "role": "human2",
        "content": "Yes, and they answered us in Yiddish, but we don't know Yiddish"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 117
  },
  {
    "id": "HH_24",
    "messages": [
      {
        "role": "human1",
        "content": "I was in the pool and I saw a dolphin"
      },
      {
        "role": "human2",
        "content": "Yes and I tried to communicate with him in the language of the dolphins"
      },
      {
        "role": "human1",
        "content": "Yes, and then I realized that she was even talking to me in English, so I laughed"
      },
      {
        "role": "human2",
        "content": "Yes and I tried to explain to them why they should invest in Bitcoin"
      },
      {
        "role": "human1",
        "content": "Then they told me to just flow with life but I realized that the Bitcoin path needs a lot of energy"
      },
      {
        "role": "human2",
        "content": "Yes and then they told me I should need them for a short swim in the Atlantic Ocean"
      },
      {
        "role": "human1",
        "content": "Yes and then in the ocean I saw a seahorse and we started a distance swimming competition"
      },
      {
        "role": "human2",
        "content": "Yes and I was really close to winning but ran out of air too soon"
      },
      {
        "role": "human1",
        "content": "Yes, and then I found an oxygen cylinder and went for a spin on the ocean floor"
      },
      {
        "role": "human2",
        "content": "Yes, and I saw very strange and colorful productions"
      },
      {
        "role": "human1",
        "content": "Yes and we started building a castle at the bottom and all the fish and colorful creatures helped build it"
      },
      {
        "role": "human2",
        "content": "Yes, and then some famous person arrived, our name is Nemo, but I didn't understand what the commotion was about him, he's just a fish"
      },
      {
        "role": "human1",
        "content": "Then Nemo and I went for a walk and came across a starfish who explained to us that life is beautiful and we should enjoy every moment"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 225
  },
  {
    "id": "HH_25",
    "messages": [
      {
        "role": "human1",
        "content": "Did you see that they opened a new pub in the shopping center?"
      },
      {
        "role": "human2",
        "content": "Yes, and all the people who came to the opening did not understand why the Sabih was purple"
      },
      {
        "role": "human1",
        "content": "Yes, and there was also a violinist on the side"
      },
      {
        "role": "human2",
        "content": "Yes, and then the owner of the club asked him to play Noah Keeler's Million Dollar"
      },
      {
        "role": "human1",
        "content": "Yes, and then Omar Adam went in to buy a dish with his new purchase because he was getting kebab"
      },
      {
        "role": "human2",
        "content": "Yes, and then Yael Shelvia also came with him and was sweet"
      },
      {
        "role": "human1",
        "content": "Yes, and I also saw that they had capers"
      },
      {
        "role": "human2",
        "content": "Yes, and they were the color of the sabih, so the owner of the sabih uploaded a picture of them to Instagram"
      },
      {
        "role": "human1",
        "content": "Yes, and then all the Tiktok and Instosh girls started uploading clips of themselves dancing to Omar's songs with the purple Sebih glasses"
      },
      {
        "role": "human2",
        "content": "Yeah and then Mark Zuckerberg came and told them it was crashing his servers"
      },
      {
        "role": "human1",
        "content": "Yes, and then Ayalon told them that he has a place for everyone on the platform"
      },
      {
        "role": "human2",
        "content": "Yes and then they made a new NFT"
      },
      {
        "role": "human1",
        "content": "Yes, and then the owner of the sabih became a millionaire and opened a chain"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 197
  },
  {
    "id": "HH_26",
    "messages": [
      {
        "role": "human1",
        "content": "Hey, let's go to the supermarket for a moment"
      },
      {
        "role": "human2",
        "content": "Yes, and we will invite Shira, who needs to buy electricity powder"
      },
      {
        "role": "human1",
        "content": "Yeah, do you remember what else she told you she needed?"
      },
      {
        "role": "human2",
        "content": "Yes extra hard mushrooms and two gears"
      },
      {
        "role": "human1",
        "content": "Okay, because she told me she wanted to go buy special food for the crocodiles she raises"
      },
      {
        "role": "human2",
        "content": "Yes, and Moshiko who helps her told how expensive it is at the supermarket and offered to grow the food himself"
      },
      {
        "role": "human1",
        "content": "Yes, but I heard from all kinds of different people that Moshiko is not what everyone thinks he is, he is different"
      },
      {
        "role": "human2",
        "content": "Yes, and when you touch it, it feels like an eggplant"
      },
      {
        "role": "human1",
        "content": "Yes, do you think it tastes like eggplant?"
      },
      {
        "role": "human2",
        "content": "Yes, and when you heat it, it softens and becomes pleasant"
      },
      {
        "role": "human1",
        "content": "Yes, but it's problematic, moshiko is an extinct breed, you can't try to taste it"
      },
      {
        "role": "human2",
        "content": "Yes and you can't warm me either because according to the rumors it is made of dangerous material"
      },
      {
        "role": "human1",
        "content": "I did understand that he was an engineer at Chernobyl a few years ago, maybe that's why"
      },
      {
        "role": "human2",
        "content": "Yes, and they say that as a child he wallowed in uranium with his friends after school"
      },
      {
        "role": "human1",
        "content": "Yes and in the football games he would watch with his family they would detonate atomic nukes"
      },
      {
        "role": "human2",
        "content": "Yes and also rare raspberry nuts from Brazil"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 222
  },
  {
    "id": "HH_27",
    "messages": [
      {
        "role": "human1",
        "content": "Remember our last visit to the Palmach Museum?"
      },
      {
        "role": "human2",
        "content": "Yes, the guide was so boring that we decided to go in the middle"
      },
      {
        "role": "human1",
        "content": "Yes and we found this secret club near the entrance of Coco Bongo"
      },
      {
        "role": "human2",
        "content": "Yes and inside the secret club there were all kinds of crazy people. There was a guy with no teeth and a 2 meter tall woman"
      },
      {
        "role": "human1",
        "content": "Yes and she had an illustrious past in the Manila basketball team"
      },
      {
        "role": "human2",
        "content": "Yes, she and the guy tried to compete to see who could score more but it wasn't a competition at all"
      },
      {
        "role": "human1",
        "content": "Then out of nowhere Shaquille O'Neal came and buried them both"
      },
      {
        "role": "human2",
        "content": "you are bad"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 9,
    "num_words": 109
  },
  {
    "id": "HH_28",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that time when we wrote you a test?"
      },
      {
        "role": "human2",
        "content": "Yes and the test was very hard"
      },
      {
        "role": "human1",
        "content": "Yes, and I had no idea how to solve it..."
      },
      {
        "role": "human2",
        "content": "yes and I gave it to the teacher and it made him cry"
      },
      {
        "role": "human1",
        "content": "Yes, indeed a sad one and that's why he failed your test."
      },
      {
        "role": "human2",
        "content": "yes and I cheered him up with ice cream and movie tickets"
      },
      {
        "role": "human1",
        "content": "Yes, and he was allergic to lectoz and died."
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 8,
    "num_words": 73
  },
  {
    "id": "HH_29",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when our little prince was born?"
      },
      {
        "role": "human2",
        "content": "yes, it was the loveliest day, there was music in the streets"
      },
      {
        "role": "human1",
        "content": "yes and all of our neighbors came to see it"
      },
      {
        "role": "human2",
        "content": "yes and he was selected as the prettiest baby in the neighborhood"
      },
      {
        "role": "human1",
        "content": "yes and also we got the bless from the Rabbi"
      },
      {
        "role": "human2",
        "content": "yes and the Rabbi told us there is a witch that wants to take our beautiful little prince"
      },
      {
        "role": "human1",
        "content": "yes and so we made a special cloth the was anti-witches"
      },
      {
        "role": "human2",
        "content": "yes and the cloth worked very well, until 18 years later..."
      },
      {
        "role": "human1",
        "content": "when our prince transformed to witch from the cursed cloth"
      },
      {
        "role": "human2",
        "content": "yes and we took him to the only person that could help, Harry Potter"
      },
      {
        "role": "human1",
        "content": "yes! and Harry took him to his highschool to teach him how to overcome his witch's manners"
      },
      {
        "role": "human2",
        "content": "yes and he once again became our sweet little prince, and was invited to meet the queen"
      },
      {
        "role": "human1",
        "content": "yes and she was so impressed that he came from Harry so she decide to run after that witch"
      },
      {
        "role": "human2",
        "content": "yes and she got the witch, sent her to prison and adopted our beautiful sweet little prince"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 186
  },
  {
    "id": "HH_30",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we were at the 2008 Wimbledon final when Nadal won for the first time?"
      },
      {
        "role": "human2",
        "content": "Yes and at the end of the game I caught the ball he threw"
      },
      {
        "role": "human1",
        "content": "Yes, and then there was some Brit who tried to steal it from you and you yelled at him"
      },
      {
        "role": "human2",
        "content": "Yes, and you panic and throw up"
      },
      {
        "role": "human1",
        "content": "Yes and then we went from there to relax a bit outside"
      },
      {
        "role": "human2",
        "content": "Yes, and then they accidentally entered Nadal's dressing room"
      },
      {
        "role": "human1",
        "content": "Yes and he was charming and we took a picture with him"
      },
      {
        "role": "human2",
        "content": "Yes and then he made us a follower on Instagram"
      },
      {
        "role": "human1",
        "content": "Yes, and we didn't follow him back to keep a positive ratio of followers"
      },
      {
        "role": "human2",
        "content": "Yes and the teasing worked so he booked us a plane ticket to Palma de Mallorca"
      },
      {
        "role": "human1",
        "content": "Yes, and we continued there before returning to Israel"
      },
      {
        "role": "human2",
        "content": "Yes and there we were at a crazy rooftop party and we saw Federer"
      },
      {
        "role": "human1",
        "content": "Yes and then I threw up again"
      },
      {
        "role": "human2",
        "content": "Yes, in Nadal's Gakuzi"
      },
      {
        "role": "human1",
        "content": "Yes and it was a bit unpleasant but I was drunk so I didn't care"
      },
      {
        "role": "human2",
        "content": "Yes, and then mom came to pick us up"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 187
  },
  {
    "id": "HH_31",
    "messages": [
      {
        "role": "human1",
        "content": "Hey, what's going on? Remember we came back from a roots trip from China a few months ago?"
      },
      {
        "role": "human2",
        "content": "Yes, and we ate a lot of sharks there"
      },
      {
        "role": "human1",
        "content": "Yes, and then we went to see the special market (of all the animals) from which the corona came out"
      },
      {
        "role": "human2",
        "content": "Yes, and you insisted on eating only bats"
      },
      {
        "role": "human1",
        "content": "Yes, and then for some reason you wanted to taste Cheetah in sweet chili sauce"
      },
      {
        "role": "human2",
        "content": "Yes and the cheetah was still alive so we chased after it"
      },
      {
        "role": "human1",
        "content": "Yes, and then when we ran out of power and couldn't catch her, we decided to spend the night in the field with a tent"
      },
      {
        "role": "human2",
        "content": "Yes and we looked at the stars"
      },
      {
        "role": "human1",
        "content": "Yes and then we saw Mofasa Simba's father in the sky"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 126
  },
  {
    "id": "HH_32",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we went to the botanical garden together?"
      },
      {
        "role": "human2",
        "content": "Yes, and we saw a lot of bats there"
      },
      {
        "role": "human1",
        "content": "Yes and one of them took your bag and ran away"
      },
      {
        "role": "human2",
        "content": "Yes and luckily Spiderman was right next door"
      },
      {
        "role": "human1",
        "content": "Yes, he really saved the day. Until he took off the mask and we found out that it was actually the villain version of Spiderman"
      },
      {
        "role": "human2",
        "content": "Yes and he said he won't bring me the bag back unless I bring him shawarma"
      },
      {
        "role": "human1",
        "content": "Luckily there was a scary good shawarma next door so we went and bought him a dish"
      },
      {
        "role": "human2",
        "content": "Yes and he ate but said he was missing Amba"
      },
      {
        "role": "human1",
        "content": "Yes, and then we invited him to a duel over the bag"
      },
      {
        "role": "human2",
        "content": "Yes and we almost beat him but he called the Silver Tiger for help"
      },
      {
        "role": "human1",
        "content": "Yes, but he didn't know that the Silver Tiger was actually my friend"
      },
      {
        "role": "human2",
        "content": "Yes, then we defeated him by knockout and went to murder Rabin"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 156
  },
  {
    "id": "HH_33",
    "messages": [
      {
        "role": "human1",
        "content": "What's going on? Any chance I saw you in Abu Hassan a week ago?"
      },
      {
        "role": "human2",
        "content": "Yes, and then we went looking for Jews in Judea"
      },
      {
        "role": "human1",
        "content": "Yes and we found one in a carpet shop near the entrance"
      },
      {
        "role": "human2",
        "content": "Yes and we bought one rug for the collection"
      },
      {
        "role": "human1",
        "content": "Yeah, and then someone offered to buy it from us in Bitcoin"
      },
      {
        "role": "human2",
        "content": "Yes and of course we made a deal because virtual money is the future"
      },
      {
        "role": "human1",
        "content": "Yes, and then there was a drop in value because inflation went up, and we got a little upset"
      },
      {
        "role": "human2",
        "content": "Yes and now we have to say goodbye, but it's only temporary, meet me at a techno party"
      },
      {
        "role": "human1",
        "content": "Yes and we will definitely meet"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 115
  },
  {
    "id": "HH_34",
    "messages": [
      {
        "role": "human1",
        "content": "What fun it was in Eilat!"
      },
      {
        "role": "human2",
        "content": "Yes and how did you drink all the desert alone"
      },
      {
        "role": "human1",
        "content": "Yes and how I threw up in front of all the girls"
      },
      {
        "role": "human2",
        "content": "Yes, and then she still carried you into the room"
      },
      {
        "role": "human1",
        "content": "Yes, and then someone else joined"
      },
      {
        "role": "human2",
        "content": "Yes, and you played Taki like crazy"
      },
      {
        "role": "human1",
        "content": "Yes and I put a +2 on her head"
      },
      {
        "role": "human2",
        "content": "Yes, and then she lost her temper"
      },
      {
        "role": "human1",
        "content": "Yes, and then you came and saw that she was nervous"
      },
      {
        "role": "human2",
        "content": "Yes and I threw her out the window into the pool"
      },
      {
        "role": "human1",
        "content": "Yes and then all her skirt came up"
      },
      {
        "role": "human2",
        "content": "From then on, the entire family of the believers left there"
      },
      {
        "role": "human1",
        "content": "Yes, and then they started playing Taki with us"
      },
      {
        "role": "human2",
        "content": "Yes, and then the one who got angry took the cards from us"
      },
      {
        "role": "human1",
        "content": "Yes, and then I threw her out the window, but this time into the room of the prostitutes"
      },
      {
        "role": "human2",
        "content": "Yes, and then they put Omar Adam on the Boombox"
      },
      {
        "role": "human1",
        "content": "Yes and then they brought us their wine bottle in return"
      },
      {
        "role": "human2",
        "content": "Yes and then it turned into raspberry juice"
      },
      {
        "role": "human1",
        "content": "Yes, and then I threw up the raspberry juice too"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 20,
    "num_words": 188
  },
  {
    "id": "HH_35",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last year you and your family landed with a spaceship in my savannah?"
      },
      {
        "role": "human2",
        "content": "Yes! And I remember that at first you wanted to devour us, luckily we told you we were poisonous"
      },
      {
        "role": "human1",
        "content": "Yes, and that's how you bypassed us in the food chain, until that time we went hunting together"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 4,
    "num_words": 52
  },
  {
    "id": "HH_36",
    "messages": [
      {
        "role": "human1",
        "content": "What's going on? were you at volleyball last week"
      },
      {
        "role": "human2",
        "content": "Yes, and we played against Maccabi London who came especially from Dubai"
      },
      {
        "role": "human1",
        "content": "Yes, and then they made a huge article about you in the newspaper"
      },
      {
        "role": "human2",
        "content": "Yes, and in the article they wrote that the duck in our group made some excellent serves"
      },
      {
        "role": "human1",
        "content": "Yes and they said that because you won you are not allowed to enter the Emirates"
      },
      {
        "role": "human2",
        "content": "Yes and we tried to sneak there in the suitcases of random passengers"
      },
      {
        "role": "human1",
        "content": "Yes, and luckily you were not discovered and you went up to the Burg"
      },
      {
        "role": "human2",
        "content": "Yes and by chance I put a parachute in my bag and jumped off the roof of the building"
      },
      {
        "role": "human1",
        "content": "Yes, and you landed right on the back of a camel and started traveling together"
      },
      {
        "role": "human2",
        "content": "Yes, and it was really, really hot that the camel started running really fast"
      },
      {
        "role": "human1",
        "content": "Yes, and then you ran out of water, so you drank from the hump"
      },
      {
        "role": "human2",
        "content": "Yes, and then a Bedouin saw me doing it and offered me to come and stay at his villa"
      },
      {
        "role": "human1",
        "content": "Yes, and then you stayed to settle there as Bedouin-Israeli hosts"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 187
  },
  {
    "id": "HH_37",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that time we were at the zoo?"
      },
      {
        "role": "human2",
        "content": "Yes and we went to the rhinoceros cage"
      },
      {
        "role": "human1",
        "content": "Yes, and the rhino was just busy. He played Tekken in Sony."
      },
      {
        "role": "human2",
        "content": "Yes, and then nostalgia hit you and you went to play in front of him"
      },
      {
        "role": "human1",
        "content": "Right. But I didn't want to take Eddie because it's cheating, but the rhino did take him so he beat me."
      },
      {
        "role": "human2",
        "content": "Right, and then you were sad and wanted to play Red light Green light against him"
      },
      {
        "role": "human1",
        "content": "Yes and I counted and tricked him and caught him moving but he refused to go back and then his friend the giraffe came"
      },
      {
        "role": "human2",
        "content": "Yes, and he stabbed her in the stomach with his horn, and lots of candy came out"
      },
      {
        "role": "human1",
        "content": "Yes, and then we realized it wasn't really a giraffe. It's a piÃ±ata, but the candy was really worth it. It was full of spray."
      },
      {
        "role": "human2",
        "content": "Right!!! Then we separated the chocolate from the peanut butter and distributed to all the diabetic hippos"
      },
      {
        "role": "human1",
        "content": "Yes, and we didn't take into account that one of the hypotomes was not only diabetic but also allergic to peanuts. He was all swollen up and then they shouted at us."
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 196
  },
  {
    "id": "HH_38",
    "messages": [
      {
        "role": "human1",
        "content": "Do you remember that a hundred years ago we visited Poland?"
      },
      {
        "role": "human2",
        "content": "And this is how we found all our relatives having a Passover meal together?"
      },
      {
        "role": "human1",
        "content": "Yes and they all came to the meal riding skateboards"
      },
      {
        "role": "human2",
        "content": "Yes, and then they told us that someone showed them that they have the Hoverboards in the Shtetl, but it's a top secret"
      },
      {
        "role": "human1",
        "content": "Yes, and we went with them to Shtetl and found all the ice cream in Poland hidden under a rock"
      },
      {
        "role": "human2",
        "content": "Yes, and then we said to ourselves \"Excuse me sir, don't you know that ice creams are kept in a cooller next to the Badulina?\""
      },
      {
        "role": "human1",
        "content": "yes and he said \"what?\" Because he didn't know Hebrew, so we had to explain with the help of modern dance"
      },
      {
        "role": "human2",
        "content": "Yes, and then we started with Polka Dove Tagno Dancing, because everyone knows it's the new hit from Ilanit"
      },
      {
        "role": "human1",
        "content": "Yes and it was such a hit that we opened the first polka studio in Poland and earned a million zlotys"
      },
      {
        "role": "human2",
        "content": "Then we took the money and our whole family and went to another continent and opened a Warnicki meat restaurant there anyway"
      },
      {
        "role": "human1",
        "content": "Yes, and on the new continent we raised a gang of dogs"
      },
      {
        "role": "human2",
        "content": "Yes, and we gave each dog its own apron and a white and blue chef's hat"
      },
      {
        "role": "human1",
        "content": "Yes and they learned to cook like in the movie ratatouille only they cooked poop because they are dogs"
      },
      {
        "role": "human2",
        "content": "Yes, and then it turns out that the taste of their corks actually tasted like Belgian chocolate and it is not clear how such a thing happened, strange"
      },
      {
        "role": "human1",
        "content": "Yes, and we lived happily ever after"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 269
  },
  {
    "id": "HH_39",
    "messages": [
      {
        "role": "human1",
        "content": "remember when we joined the army together?"
      },
      {
        "role": "human2",
        "content": "yes for the best unit in spain"
      },
      {
        "role": "human1",
        "content": "yes and we went on a mission to give food to kids in africa"
      },
      {
        "role": "human2",
        "content": "yes and we started to make food from olives"
      },
      {
        "role": "human1",
        "content": "yes and the kids loved the food so much that they adopted us"
      },
      {
        "role": "human2",
        "content": "yes and we started to our second mission"
      },
      {
        "role": "human1",
        "content": "yes and this time the commander said we need to eat food - not make it"
      },
      {
        "role": "human2",
        "content": "yes so we started to eat so much food, we wighted 200 KG"
      },
      {
        "role": "human1",
        "content": "yes and became sumo wrestlers"
      },
      {
        "role": "human2",
        "content": "yes and we took all the salt from our kitchen to the sumo field"
      },
      {
        "role": "human1",
        "content": "yes and in the sumo field we saw sumo wrestlers growing on trees"
      },
      {
        "role": "human2",
        "content": "yes and we started the make sumo-wrstlers-shake to all of our kids"
      },
      {
        "role": "human1",
        "content": "yes and that made all of us so big that we were stuck in the house for 2 years"
      },
      {
        "role": "human2",
        "content": "yes and we couldn't make a haircut so our hair went out of the windows"
      },
      {
        "role": "human1",
        "content": "yes and then a princess climbed our hair and rescued us - by giving us Zumba lessons"
      },
      {
        "role": "human2",
        "content": "we are done"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 186
  },
  {
    "id": "HH_40",
    "messages": [
      {
        "role": "human1",
        "content": "How funny it was on the immigration ship when we got to Israel"
      },
      {
        "role": "human2",
        "content": "Yes, it was amazing, there was a rough sea"
      },
      {
        "role": "human1",
        "content": "Yes, and some two sailors there didn't stop vomiting"
      },
      {
        "role": "human2",
        "content": "Yes, and then lifeboats were distributed to everyone"
      },
      {
        "role": "human1",
        "content": "Yes, and then this refresher stop in Cyprus really helped"
      },
      {
        "role": "human2",
        "content": "Yes, and then Ariel the mermaid came to save me"
      },
      {
        "role": "human1",
        "content": "Yes and then I also wished we could breathe underwater like her"
      },
      {
        "role": "human2",
        "content": "Yes, and then she stopped talking, they took away her voice"
      },
      {
        "role": "human1",
        "content": "Yeah and then it was really cool that we helped her find it again"
      },
      {
        "role": "human2",
        "content": "Yes and then she died"
      },
      {
        "role": "human1",
        "content": "Yes, and then Neptune was really sad and we stayed to comfort him"
      },
      {
        "role": "human2",
        "content": "Yes and then we went up and flew with a seagull to the palace"
      },
      {
        "role": "human1",
        "content": "Yes, and then there was a really big banquet where we were the guests of honor"
      },
      {
        "role": "human2",
        "content": "Yes and then we ate a lot of crabs, we almost ate Sebastian"
      },
      {
        "role": "human1",
        "content": "Yes, and then I fell in love with this food and you got really drunk with flounder"
      },
      {
        "role": "human2",
        "content": "Yes and then I asked him to marry me and he said he couldn't because he was a fish"
      },
      {
        "role": "human1",
        "content": "Yes and then we took it home with us so that at least it would be our pet fish"
      },
      {
        "role": "human2",
        "content": "Yes, and then I asked you to marry me :))"
      },
      {
        "role": "human1",
        "content": "Yes and I agreed :)"
      },
      {
        "role": "human2",
        "content": "Yes and since then we live happily ever after"
      },
      {
        "role": "human1",
        "content": "Yes, and since then I realized that this is what it will be and I don't stop thinking about how fun it is"
      },
      {
        "role": "human2",
        "content": "Yes and then we will become kings and he will have a castle"
      },
      {
        "role": "human1",
        "content": "Yes and we will make all our dreams come true"
      },
      {
        "role": "human2",
        "content": "Yes, and we will have a lot of fun with Ariel, Seagull and Triton"
      },
      {
        "role": "human1",
        "content": "Yes and maybe we will upgrade our castle with other characters that we like besides them like the genie"
      },
      {
        "role": "human2",
        "content": "Yes, and then we will have a menorah and we will ask him full of wishes"
      },
      {
        "role": "human1",
        "content": "Yes and maybe he will even marry us and then give us more wishes"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 28,
    "num_words": 346
  },
  {
    "id": "HH_41",
    "messages": [
      {
        "role": "human1",
        "content": "do you remember our first exam?"
      },
      {
        "role": "human2",
        "content": "yes it was very long and very scary"
      },
      {
        "role": "human1",
        "content": "yes and I thought that we will die on that exam, by the guards"
      },
      {
        "role": "human2",
        "content": "yes and that's why we made a resistance group against the guards"
      },
      {
        "role": "human1",
        "content": "yes and then the guards started to interrupt us"
      },
      {
        "role": "human2",
        "content": "yes and we declared war on the guards, started a new nation called \"Test Strees\""
      },
      {
        "role": "human1",
        "content": "yes and one of us thought its called \"Test streets\""
      },
      {
        "role": "human2",
        "content": "yes and we changed the name to \"Test streets\" and made him our king"
      },
      {
        "role": "human1",
        "content": "yes and then we were guarded by our community in all of the exams"
      },
      {
        "role": "human2",
        "content": "yes and the community had special dinners before every exam - and one night, a fly entered the room where we had dinner"
      },
      {
        "role": "human1",
        "content": "yes and then the fly got inside the king's plate"
      },
      {
        "role": "human2",
        "content": "yes and we declared war on all the flies"
      },
      {
        "role": "human1",
        "content": "yes and we lose the battle"
      },
      {
        "role": "human2",
        "content": "yes and we become citizens in a fly controlled world"
      },
      {
        "role": "human1",
        "content": "yes and started to worships to the queen of all of the bees"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 174
  },
  {
    "id": "HH_42",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we visited London?"
      },
      {
        "role": "human2",
        "content": "yes we saw the greatest tennis match I saw in my life"
      },
      {
        "role": "human1",
        "content": "yes and it was so hot that day that the tennis ball melted"
      },
      {
        "role": "human2",
        "content": "yes and it was look like our ice creams balls"
      },
      {
        "role": "human1",
        "content": "yes and we started eating the tennis balls with chocolate sauce"
      },
      {
        "role": "human2",
        "content": "yes! and we called the dish: Ferero RoGER federer rocher"
      },
      {
        "role": "human1",
        "content": "yes and it was so good that we opened a restaurant together that became the best restaurant in the universe"
      },
      {
        "role": "human2",
        "content": "yes and all the tennis-chocolate fans came to eat our desserts"
      },
      {
        "role": "human1",
        "content": "yes and we opened new restaurants in a lot of places including: new york, Jerusalem and planet mars"
      },
      {
        "role": "human2",
        "content": "yes and the most successful was the one was in mars, because of the milky-way"
      },
      {
        "role": "human1",
        "content": "yes and we were so rich we decided to run for president of Earth - the first people to do so as a couple"
      },
      {
        "role": "human2",
        "content": "yes and then we ruled all the galaxy"
      },
      {
        "role": "human1",
        "content": "yes and we made a new rule that every creature alive must take a nap"
      },
      {
        "role": "human2",
        "content": "yes and also one cold beer before every nap, including children"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 184
  },
  {
    "id": "HH_43",
    "messages": [
      {
        "role": "human1",
        "content": "remember when we were both news anchors"
      },
      {
        "role": "human2",
        "content": "yes and we had to fight other news crews once a year in the tournement"
      },
      {
        "role": "human1",
        "content": "yes and it was very unexpected, always went wrong so quickly"
      },
      {
        "role": "human2",
        "content": "yes and we always had friends coming to see us fight"
      },
      {
        "role": "human1",
        "content": "yes and one time we decided that instead of a fight we will do a rap battle"
      },
      {
        "role": "human2",
        "content": "yes and we won all the battles but the final"
      },
      {
        "role": "human1",
        "content": "yes and that haunted us for 10 years"
      },
      {
        "role": "human2",
        "content": "yes and that's we we aren't news anchors anymore"
      },
      {
        "role": "human1",
        "content": "yes and we drifted the universe for years as hired soccer players for inner galactic tournaments"
      },
      {
        "role": "human2",
        "content": "yes and we won all the matches but the finals"
      },
      {
        "role": "human1",
        "content": "yes and that drove us to madness, so we went into the first ocean we could find to become jellyfish"
      },
      {
        "role": "human2",
        "content": "yes and we could finally be free from finals because we had no brains"
      },
      {
        "role": "human1",
        "content": "yes and we lived in harmony with nature until our moms called us home for dinner"
      },
      {
        "role": "human2",
        "content": "yes and they made us our favourite - steamed jellyfish"
      },
      {
        "role": "human1",
        "content": "yes and we enjoyed it so much we had to make a news story about how good it is"
      },
      {
        "role": "human2",
        "content": "yes and that's how we became the first news anchors to love jellyfish"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 207
  },
  {
    "id": "HH_44",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we went to a pool last week?"
      },
      {
        "role": "human2",
        "content": "Yes and there was no room in the grown-ups pool"
      },
      {
        "role": "human1",
        "content": "Yes, so we went to the small pond and there was a duck"
      },
      {
        "role": "human2",
        "content": "Yes, a real duck swimming in circles there, colorful and beautiful"
      },
      {
        "role": "human1",
        "content": "Yes, and then a missile came and destroyed the place"
      },
      {
        "role": "human2",
        "content": "Yes it was that scary! Everyone was running everywhere. Lucky we dived underwater"
      },
      {
        "role": "human1",
        "content": "Yes and inside the water was an underwater city full of talking fish"
      },
      {
        "role": "human2",
        "content": "Yes and mermaids. I didn't think these things were real. Then we went into a bar there called \"Moby Dick\""
      },
      {
        "role": "human1",
        "content": "Yes, and inside the bar we saw a mermaid doing magic and juggling!"
      },
      {
        "role": "human2",
        "content": "Yes, even juggling! And remembers how scared we were when suddenly two sharks came in and sat next to us on the bar"
      },
      {
        "role": "human1",
        "content": "One of them had a tattoo of a titan on his arm"
      },
      {
        "role": "human2",
        "content": "Yes he was the scarier one. And they were upset that we tried to start with the mermaids. The one with the tattoo really pushed you"
      },
      {
        "role": "human1",
        "content": "Yes it was scary, luckily Johnny Depp came out of nowhere and saved us"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 188
  },
  {
    "id": "HH_45",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we played an anime game?"
      },
      {
        "role": "human2",
        "content": "Yes and the main character had spiky hair"
      },
      {
        "role": "human1",
        "content": "Yes and we tried mimicking the hairstyle and moves"
      },
      {
        "role": "human2",
        "content": "Yes and it looked really good on us, so we started modeling"
      },
      {
        "role": "human1",
        "content": "Yes and we got and anime game of our own"
      },
      {
        "role": "human2",
        "content": "Yes and in our game all the characters spoke in latin"
      },
      {
        "role": "human1",
        "content": "Yes and we didnâ€™t understand anything because we donâ€™t speak or read latin"
      },
      {
        "role": "human2",
        "content": "Yes and then we got sued because the game said mean things and we didnâ€™t understand enough to remove them"
      },
      {
        "role": "human1",
        "content": "Yes and then we won the case because the judge and jury didnâ€™t understand latin either"
      },
      {
        "role": "human2",
        "content": "Yes and we got exactly one billion dollars from the settlement"
      },
      {
        "role": "human1",
        "content": "Yes and with that money we developed a second game that was about the trail"
      },
      {
        "role": "human2",
        "content": "Yes and it was the first game ever to get a perfect score by reviewers worldwide"
      },
      {
        "role": "human1",
        "content": "Yes and because of that we got to be the first settlers on mars now known as the gaming planet"
      },
      {
        "role": "human2",
        "content": "Yes and we became kings on the planet and played until we couldnâ€™t anymore"
      },
      {
        "role": "human1",
        "content": "Yes and later we had sons to succeed us but they didn't want to rule the planet"
      },
      {
        "role": "human2",
        "content": "Yes and they became doctors"
      },
      {
        "role": "human1",
        "content": "Yes and they developed a game about becoming a doctor, but they hid it from us"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 221
  },
  {
    "id": "HH_46",
    "messages": [
      {
        "role": "human1",
        "content": "What is going on? Remember we went to hummus last week?"
      },
      {
        "role": "human2",
        "content": "Yes and I ordered a banana lotti"
      },
      {
        "role": "human1",
        "content": "Yes and then we went to the beach to play matkas"
      },
      {
        "role": "human2",
        "content": "Yes, and then the guy who sells popsicles came and we bought a chocobo vanilla popsicle from him"
      },
      {
        "role": "human1",
        "content": "Yes and then the delicious part of the chocobo melted and fell on the sand"
      },
      {
        "role": "human2",
        "content": "Yes and then I was so hot on the tasty part that I went in with the part that fell into the sea, washed it and ate it"
      },
      {
        "role": "human1",
        "content": "Yes, and then the lifeguard shouted to you from the booth \"well done\" and the whole beach clapped"
      },
      {
        "role": "human2",
        "content": "Yes and then we saw a pod of dolphins that jumped and did somersaults just for me"
      },
      {
        "role": "human1",
        "content": "Yes and then the head of the dolphin group swam up to you and gave you a kiss on the forehead"
      },
      {
        "role": "human2",
        "content": "Yes, and then his daughter also came and hot on me"
      },
      {
        "role": "human1",
        "content": "Yes, and then she brought her friend Tabat Yam and we decided that we would go out to her place in the evening"
      },
      {
        "role": "human2",
        "content": "Yes, and then when we got to Shaluta, we saw Kobi Suisa KS there"
      },
      {
        "role": "human1",
        "content": "Yes and then we all took a picture next to his nipple and returned home"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 210
  },
  {
    "id": "HH_47",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we were in space last week?"
      },
      {
        "role": "human2",
        "content": "Yes and we were almost late for the spaceship"
      },
      {
        "role": "human1",
        "content": "Yes and we were able to at the last minute thanks to my brother"
      },
      {
        "role": "human2",
        "content": "Yes and thanks to the fact that Batman lent him his car"
      },
      {
        "role": "human1",
        "content": "Yes, and how fun that Batman was a good sport and also agreed to join the trip to Mars"
      },
      {
        "role": "human2",
        "content": "Yes and what good vibes there were with the aliens there"
      },
      {
        "role": "human1",
        "content": "Yes and how funny it was at their pool party"
      },
      {
        "role": "human2",
        "content": "Yes, and the alien who suddenly became an alien killed everyone with laughter"
      },
      {
        "role": "human1",
        "content": "Yes, and the alcohol there was so weird! out of body experience"
      },
      {
        "role": "human2",
        "content": "Yes, and everyone who came from Earth suddenly grew a tail after drinking"
      },
      {
        "role": "human1",
        "content": "Yes and I really always wanted a tail. Too bad we had to have it surgically removed when we got back"
      },
      {
        "role": "human2",
        "content": "Yes, and it was a bit crowded in the tube on the way back, next time we'll do surgery on Mars"
      },
      {
        "role": "human1",
        "content": "Yes and I hope my health insurance covers surgery on other planets"
      },
      {
        "role": "human2",
        "content": "Yes, and someone told me that if a local operates on you, you get out of the operation in half the time"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 197
  },
  {
    "id": "HH_48",
    "messages": [
      {
        "role": "human1",
        "content": "Once upon a time there was a little fairy who lived in the forest named Plantina"
      },
      {
        "role": "human2",
        "content": "Yes, and the beautiful one was the most beautiful fairy in the whole forest"
      },
      {
        "role": "human1",
        "content": "Yes and according to her there were also several helpers who were always around her and together they went on velvet journeys of flowers"
      },
      {
        "role": "human2",
        "content": "Yes, until one day they accidentally picked a special mushroom"
      },
      {
        "role": "human1",
        "content": "Yes and this mushroom made them feel a huge love"
      },
      {
        "role": "human2",
        "content": "Yes and they loved each other so much that they all hugged each other"
      },
      {
        "role": "human1",
        "content": "Yes, and then they realized that the stars were signaling to them that there were fireflies in the night air"
      },
      {
        "role": "human2",
        "content": "Yes, and then suddenly the fireflies turned into big monsters"
      },
      {
        "role": "human1",
        "content": "Yes, and the monsters turned out to really like cinnamon"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 129
  },
  {
    "id": "HH_49",
    "messages": [
      {
        "role": "human1",
        "content": "Do you remember our last chess game?"
      },
      {
        "role": "human2",
        "content": "yes it was very interesting, took us three months to finish"
      },
      {
        "role": "human1",
        "content": "yes and kasparov came on our last month"
      },
      {
        "role": "human2",
        "content": "yes and something was weird about him, he had a chip in his forehead and said he was now an AI"
      },
      {
        "role": "human1",
        "content": "yes and then we started to reprogram him, for our special need"
      },
      {
        "role": "human2",
        "content": "yes and together with AI kasparov we were able to make pizza"
      },
      {
        "role": "human1",
        "content": "yes this pizza was with topping like chips, from Kasparov hands"
      },
      {
        "role": "human2",
        "content": "yes and we also started making beer with AI kasparov - so now we had pizza and beers"
      },
      {
        "role": "human1",
        "content": "yes and when we drank this homemade beers we understood that it was a bad idea"
      },
      {
        "role": "human2",
        "content": "yes and we told him that his beers were bad so he got angry and started running"
      },
      {
        "role": "human1",
        "content": "yes and then you did your best chess trick, you took the knight and ran after him"
      },
      {
        "role": "human2",
        "content": "yes and we met on the edge of a cliff in the rain, I had the knight in my hand, he had a bottle of water, we both had tears in our eyes"
      },
      {
        "role": "human1",
        "content": "yes and screamed, and shouted that dignity is better than donuts"
      },
      {
        "role": "human2",
        "content": "yes and we hugged each other and you came with new beers that were tasty, we all drank and laughed"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 215
  },
  {
    "id": "HH_50",
    "messages": [
      {
        "role": "human1",
        "content": "Remamber when we were kids and won the lottery?"
      },
      {
        "role": "human2",
        "content": "Yes and we decided to fly to Syria"
      },
      {
        "role": "human1",
        "content": "Yes abd I wnated to buy a wig there"
      },
      {
        "role": "human2",
        "content": "Yes so that you would have a place for your lice"
      },
      {
        "role": "human1",
        "content": "Yes and we went to see a movie there"
      },
      {
        "role": "human2",
        "content": "Ahmed 70 thousand virgins avenge"
      },
      {
        "role": "human1",
        "content": "Yes and the movie was really scary"
      },
      {
        "role": "human2",
        "content": "so scary that we covered our eyes with the wig"
      },
      {
        "role": "human1",
        "content": "Yes and I wanted to run away back home"
      },
      {
        "role": "human2",
        "content": "Yes and also to buy chocolates"
      },
      {
        "role": "human1",
        "content": "Yes and then I decided to adopt a pet dolphin"
      },
      {
        "role": "human2",
        "content": "Yes, and we decided to name him Ahmed after the hero of the film"
      },
      {
        "role": "human1",
        "content": "Yes and then he died because I fed him too much"
      },
      {
        "role": "human2",
        "content": "Yes, and because he was disadvantaged because of all the racism around him"
      },
      {
        "role": "human1",
        "content": "Yes and in the end I chose another animal"
      },
      {
        "role": "human2",
        "content": "Yes, and then we chose to fly with her to Mars"
      },
      {
        "role": "human1",
        "content": "Yes and there we saw a lot of aliens"
      },
      {
        "role": "human2",
        "content": "Yes and they offered us a taste of their food"
      },
      {
        "role": "human1",
        "content": "Yes and then the canoe is full of glowing pink puke"
      },
      {
        "role": "human2",
        "content": "Yes and then the vomit became our copy and started walking around with us and making jokes"
      },
      {
        "role": "human1",
        "content": "Yes and we wanted to go home from there"
      },
      {
        "role": "human2",
        "content": "Yes but the house was destroyed and the vomit kept following us"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 23,
    "num_words": 220
  },
  {
    "id": "HH_51",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that last year we drank wine in Colombia?"
      },
      {
        "role": "human2",
        "content": "Yes and I freaked out from it"
      },
      {
        "role": "human1",
        "content": "Yes.. and I helped you shower it was a bit awkward remember?"
      },
      {
        "role": "human2",
        "content": "Yesâ€¦..and I threw up on your white shirt too"
      },
      {
        "role": "human1",
        "content": "Yes!!!! How I loved her, come on. And the next day remember how scary it was in the favela?"
      },
      {
        "role": "human2",
        "content": "Yes! And there were those in the hats who looked really, really scary with weapons"
      },
      {
        "role": "human1",
        "content": "Yes, and there was someone who shot Freddie, remember him? What a heartache"
      },
      {
        "role": "human2",
        "content": "Yes very much, and you managed to dance like there is no tomorrow"
      },
      {
        "role": "human1",
        "content": "start*"
      },
      {
        "role": "human2",
        "content": "Yes, that's how I express sadness.."
      },
      {
        "role": "human1",
        "content": "Then we went to his funeral remember"
      },
      {
        "role": "human2",
        "content": "Yes and then his ghost came out of the grave, he tried to take you to be with him"
      },
      {
        "role": "human1",
        "content": "Yes and I really tried to get her to take me but it didn't work"
      },
      {
        "role": "human2",
        "content": "Too bad we had good sex"
      },
      {
        "role": "human1",
        "content": "Yes, and then he also said that he has diseases, what fun!"
      },
      {
        "role": "human2",
        "content": "Yes, and then I got chlamydia and I got you too"
      },
      {
        "role": "human1",
        "content": "To this day I have chlamydia!!"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 181
  },
  {
    "id": "HH_52",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last year we wanted to look for Atlantis"
      },
      {
        "role": "human2",
        "content": "Yes, and we will turn around"
      },
      {
        "role": "human1",
        "content": "We walked all over the sea"
      },
      {
        "role": "human2",
        "content": "Yes, especially in Eilat, there were rumors that she was hiding there"
      },
      {
        "role": "human1",
        "content": "Yes, we heard that it is at the Herod Hotel"
      },
      {
        "role": "human2",
        "content": "Yes and we got to the hotel and then the manager said we need a permit to enter and another permit to search"
      },
      {
        "role": "human1",
        "content": "Yes! We decided to burst into the hotel shouting"
      },
      {
        "role": "human2",
        "content": "Yes ! Then the guards offered us and we decided that if we didn't manage to get a permit then we would infiltrate again at night"
      },
      {
        "role": "human1",
        "content": "Yes, and then we forged a certificate on a used certificate"
      },
      {
        "role": "human2",
        "content": "Yes and we started looking upstairs just to make sure Atlantis really did sink"
      },
      {
        "role": "human1",
        "content": "Right! We notified the roof of the hotel!"
      },
      {
        "role": "human2",
        "content": "Yes, and then we realized that she was probably under the hotel"
      },
      {
        "role": "human1",
        "content": "Yes and we ran to the basement, under the laundry room"
      },
      {
        "role": "human2",
        "content": "Yes, because all the washing water has to go somewhere"
      },
      {
        "role": "human1",
        "content": "Yes, all the dirty water from every Red Sea gulf ended up in this basement"
      },
      {
        "role": "human2",
        "content": "Yes, which would confirm our theory that the city is buried under the hotel"
      },
      {
        "role": "human1",
        "content": "Right! Then we went on a much cheaper holiday there"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 207
  },
  {
    "id": "HH_53",
    "messages": [
      {
        "role": "human1",
        "content": "Remember the other day we saw flying whales?"
      },
      {
        "role": "human2",
        "content": "Yes of course! One of them offered us a ride to Rosh Pina and we got on"
      },
      {
        "role": "human1",
        "content": "Yes, and then at the end we got off one stop before, in the moon"
      },
      {
        "role": "human2",
        "content": "Yes, and then we didn't go inside in the end, because there was a full moon.."
      },
      {
        "role": "human1",
        "content": "Yes, so in the end we cut to Mars but we had to split up, you go in and I'm a woman - I went to Venus"
      },
      {
        "role": "human2",
        "content": "Yes, Eitan Stiva came and we bet how far from the earth we would go"
      },
      {
        "role": "human1",
        "content": "Yes and you said that if you lose each other you will meet in another hour at Supernova corner of the milky way"
      },
      {
        "role": "human2",
        "content": "Yes and after an hour he didn't come so I stopped to rest on Bitalgus until he came"
      },
      {
        "role": "human1",
        "content": "Yeah and then John Lennon joined you for a cigarette"
      },
      {
        "role": "human2",
        "content": "Yes, and after a few naps Meir Ariel also arrived and we played until we saw the sun coming up again"
      },
      {
        "role": "human1",
        "content": "And together they sang \"here comes the sunFLOEWR\""
      },
      {
        "role": "human2",
        "content": "Yes and we were crazy excited"
      },
      {
        "role": "human1",
        "content": "Yes, how could you not?"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 190
  },
  {
    "id": "HH_54",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we went skiing?"
      },
      {
        "role": "human2",
        "content": "Yes and we met jimmy there"
      },
      {
        "role": "human1",
        "content": "Yes and he taught us how to do a crazy triple flip"
      },
      {
        "role": "human2",
        "content": "Yes and we all did them together and broke each otherâ€™s backs"
      },
      {
        "role": "human1",
        "content": "Yes and we had to go to a special hospital"
      },
      {
        "role": "human2",
        "content": "Yes and the hospital was at full capacity so we just put a band-aid on"
      },
      {
        "role": "human1",
        "content": "Yes and it was a magical band-aid that cured all diseases and broken bones"
      },
      {
        "role": "human2",
        "content": "Yes and it cost us literally and arm and a leg, but not ours"
      },
      {
        "role": "human1",
        "content": "Yes and we went to the black market to buy flowers, chocolate and arms and legs"
      },
      {
        "role": "human2",
        "content": "Yes and the flowers were deadly to people who like chocolate and arms and legs"
      },
      {
        "role": "human1",
        "content": "Yes and so jimmy sadly died, so we both went to school to learn design to make him a nice card"
      },
      {
        "role": "human2",
        "content": "Yes and the card turned out to be deadly again so we double killed him, making him alive again"
      },
      {
        "role": "human1",
        "content": "Yes and to celebrate his resurrection we went out for drinks on the top of the mountain"
      },
      {
        "role": "human2",
        "content": "Yes and there we met an old guru"
      },
      {
        "role": "human1",
        "content": "Yes and he taught us how to do a gnarly 360 quadruple flip"
      },
      {
        "role": "human2",
        "content": "Yes and Jimmy tried it before he was done teaching us and he died again"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 213
  },
  {
    "id": "HH_55",
    "messages": [
      {
        "role": "human1",
        "content": "Remember how nazi you were"
      },
      {
        "role": "human2",
        "content": "Yes, and how I loved eating Jews like you"
      },
      {
        "role": "human1",
        "content": "Yes, but you are weaker than that"
      },
      {
        "role": "human2",
        "content": "Yes, and since the war I've gotten very strong in a basement in Argentina"
      },
      {
        "role": "human1",
        "content": "Yes, Argentina, you've been somewhere else"
      },
      {
        "role": "human2",
        "content": "Yes, and then you joined me on the trip"
      },
      {
        "role": "human1",
        "content": "Yes, after you forced me"
      },
      {
        "role": "human2",
        "content": "Yes, but I didn't use much force"
      },
      {
        "role": "human1",
        "content": "Yes, one more second in handcuffs and that's it"
      },
      {
        "role": "human2",
        "content": "Yes, but such pink handcuffs are beautiful"
      },
      {
        "role": "human1",
        "content": "Yes fur you say"
      },
      {
        "role": "human2",
        "content": "Yes, wow"
      },
      {
        "role": "human1",
        "content": "And how could you not download them?"
      },
      {
        "role": "human2",
        "content": "Yes, a moment we will never forget"
      },
      {
        "role": "human1",
        "content": "Yes, and since then you've also gotten stronger"
      },
      {
        "role": "human2",
        "content": "Yes, I will have superpowers"
      },
      {
        "role": "human1",
        "content": "Yes and you know how to fly and everything"
      },
      {
        "role": "human2",
        "content": "Yes I took Red Bull"
      },
      {
        "role": "human1",
        "content": "Yes, but you didn't add enough vodka"
      },
      {
        "role": "human2",
        "content": "Yes, it makes me nervous"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 21,
    "num_words": 138
  },
  {
    "id": "HH_56",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we fought iran?"
      },
      {
        "role": "human2",
        "content": "Yes and we joined with the resistance group called - â€œthe jelly belliesâ€"
      },
      {
        "role": "human1",
        "content": "Yes and they accepted us because we had jelly bellies"
      },
      {
        "role": "human2",
        "content": "Yes and we started a book reading club inside the resistance group"
      },
      {
        "role": "human1",
        "content": "Yes and the book we read was the bible"
      },
      {
        "role": "human2",
        "content": "Yes and we liked it so much that we made a musical about the bible"
      },
      {
        "role": "human1",
        "content": "Yes and it became an overnight sensation in southeast asia"
      },
      {
        "role": "human2",
        "content": "Yes and we got drunk with power and drove all over asia in a limo"
      },
      {
        "role": "human1",
        "content": "Yes and then we vomited all over the industry"
      },
      {
        "role": "human2",
        "content": "Yes and that gave us an idea to create a movie about vomit"
      },
      {
        "role": "human1",
        "content": "Yes and the movie again became a huge hit, this time only in dubai"
      },
      {
        "role": "human2",
        "content": "Yes and we flew to dubai for a ceremony, and in the hotel there was a japanese water ghost"
      },
      {
        "role": "human1",
        "content": "Yes and she gave great massages"
      },
      {
        "role": "human2",
        "content": "Yes and we became so relaxed that everything looked like it was colored pink"
      },
      {
        "role": "human1",
        "content": "Yes and that was great because pink is your color so you finally fit in"
      },
      {
        "role": "human2",
        "content": "Yes and I could finally feel like myself as a pink panther impersonator"
      },
      {
        "role": "human1",
        "content": "Yes and i could finally be happy with myself because iâ€™m your trusty pink sidekick"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 208
  },
  {
    "id": "HH_57",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week when we went to spain?"
      },
      {
        "role": "human2",
        "content": "yes and we met the king of spain"
      },
      {
        "role": "human1",
        "content": "yes and he took us on a tour of his castle"
      },
      {
        "role": "human2",
        "content": "yes and the view was so nice we asked if we can stay forever"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 5,
    "num_words": 42
  },
  {
    "id": "HH_58",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we went to a beach party?"
      },
      {
        "role": "human2",
        "content": "Yes, I used to sell popsicles and I bought a Magnum for a million NIS"
      },
      {
        "role": "human1",
        "content": "Yes, but the magnum was gold and it broke your teeth"
      },
      {
        "role": "human2",
        "content": "Yes, and we went to the emergency room and they replaced my teeth with surgeon's knives"
      },
      {
        "role": "human1",
        "content": "Yes, and in the hospital we saw G Yafit and she tried to sell us a portable oven"
      },
      {
        "role": "human2",
        "content": "Yes, and in the end we bought her an automatic onion peeler that works on methane gas"
      },
      {
        "role": "human1",
        "content": "Yes and then you tried to eat the onion but you couldn't because of the knives"
      },
      {
        "role": "human2",
        "content": "Yes and we both cried a lot, me because of the lack of teeth and you because of the onion"
      },
      {
        "role": "human1",
        "content": "Yes it was sad. But then Shahar Hasson arrived and we laughed at him because he is a Yemeni maniac"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 143
  },
  {
    "id": "HH_59",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week when we went skiing?"
      },
      {
        "role": "human2",
        "content": "Yes and we both tried the black track"
      },
      {
        "role": "human1",
        "content": "Yes and it went so horribly wrong..."
      },
      {
        "role": "human2",
        "content": "Yes and we still tried it again, because of the view at the top"
      },
      {
        "role": "human1",
        "content": "Yes and that time we met the local ski champion at the top"
      },
      {
        "role": "human2",
        "content": "Yes and he was a really chill guy, it was very nice of him to give us some tips"
      },
      {
        "role": "human1",
        "content": "Yes and that's how we discovered all the cool off-piste tracks"
      },
      {
        "role": "human2",
        "content": "Yes and that was really cool that we got to learn that at the beginning of the trip"
      },
      {
        "role": "human1",
        "content": "Yes and we spent the rest of the trip exploring the mountain"
      },
      {
        "role": "human2",
        "content": "Yes and we even got back all safe and sound!"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 120
  },
  {
    "id": "HH_60",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week when we went to the concert?"
      },
      {
        "role": "human2",
        "content": "Yesterday we went to watch a football match"
      },
      {
        "role": "human1",
        "content": "yes, and it was a great game"
      },
      {
        "role": "human2",
        "content": "Yes, and they scored 3 goals until the break and in the break I got hungry"
      },
      {
        "role": "human1",
        "content": "yes, and we went to the cafeteria to eat hotdogs and some soda"
      },
      {
        "role": "human2",
        "content": "Yes, but they did not have Soda"
      },
      {
        "role": "human1",
        "content": "yes, and we took a beer instead"
      },
      {
        "role": "human2",
        "content": "Yes, and we got very drunk in the second half"
      },
      {
        "role": "human1",
        "content": "yes, and when the rain started we could not see the pitch"
      },
      {
        "role": "human2",
        "content": "Yes and then we started singing out loud"
      },
      {
        "role": "human1",
        "content": "yes, and them the top scorer of out team gave us a signed shirt"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 112
  },
  {
    "id": "HH_61",
    "messages": [
      {
        "role": "human1",
        "content": "A week ago we packed a suitcase and got on a plane"
      },
      {
        "role": "human2",
        "content": "Yes and we also took our dog with us"
      },
      {
        "role": "human1",
        "content": "An and he really doesn't like flying,"
      },
      {
        "role": "human2",
        "content": "Yes, we actually tried to bring him games"
      },
      {
        "role": "human1",
        "content": "Yes, and it didn't help, he threw up on the pilot right before take off"
      },
      {
        "role": "human2",
        "content": "Yes, and in the end we landed in Peru"
      },
      {
        "role": "human1",
        "content": "Yes, and there was a crazy and colorful carnival"
      },
      {
        "role": "human2",
        "content": "Yes and a lot of fireworks and music"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 9,
    "num_words": 78
  },
  {
    "id": "HH_62",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that time we were working out and wondering what we do?"
      },
      {
        "role": "human2",
        "content": "Yes and we had some great time in the lab"
      },
      {
        "role": "human1",
        "content": "Yes, and it was hard doing pushups with Covid all around."
      },
      {
        "role": "human2",
        "content": "Yes and we still did it, even if the air condition didn't work"
      },
      {
        "role": "human1",
        "content": "Yes, and the smell was pretty bad... I wonder if that's what made the girls leave the lab."
      },
      {
        "role": "human2",
        "content": "Yes and surprisingly, after it got real bad, even more people joined us"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 7,
    "num_words": 78
  },
  {
    "id": "HH_63",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we ate electric dust?"
      },
      {
        "role": "human2",
        "content": "Sure and then all your hair stood straight up"
      },
      {
        "role": "human1",
        "content": "Yes and then I put it in the washing machine with a gentle wash program and it fixed everything"
      },
      {
        "role": "human2",
        "content": "Yes but then we accidentally pressed hot wash and got sucked into another dimension"
      },
      {
        "role": "human1",
        "content": "Yes and on the way there we passed a black guy"
      },
      {
        "role": "human2",
        "content": "We gave fun to the black hole and he gave up on us and let us continue on our way"
      },
      {
        "role": "human1",
        "content": "Yes, and the whiz made us really spin until we reached the gate of the new dimension"
      },
      {
        "role": "human2",
        "content": "Then in the new dimension we went to eat green rain flavored ice cream"
      },
      {
        "role": "human1",
        "content": "Yes, and she was even pink"
      },
      {
        "role": "human2",
        "content": "It turns out that pink tastes like green there"
      },
      {
        "role": "human1",
        "content": "Yes, and it turns out that Anita's franchisee there is color blind"
      },
      {
        "role": "human2",
        "content": "Yes, but there he is also the owner of Otello, there is a monopoly on ice cream"
      },
      {
        "role": "human1",
        "content": "Yes, and their parliament is now passing new legislation on it that will be possible to import"
      },
      {
        "role": "human2",
        "content": "I heard they will bring ice cream from Tesla"
      },
      {
        "role": "human1",
        "content": "Electric car flavored ice cream"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 186
  },
  {
    "id": "HH_64",
    "messages": [
      {
        "role": "human1",
        "content": "How much do I want to go on vacation?"
      },
      {
        "role": "human2",
        "content": "Yes and fly to Thailand"
      },
      {
        "role": "human1",
        "content": "Yes, and that some Thai girl will give me a full body massage"
      },
      {
        "role": "human2",
        "content": "Yes and drink coconut water from a coconut on the beach"
      },
      {
        "role": "human1",
        "content": "Yes, and maybe we'll bring some acai from Brazil"
      },
      {
        "role": "human2",
        "content": "Yes, and we'll go on a pub crawl"
      },
      {
        "role": "human1",
        "content": "Yes, and then we will return to the exam period"
      },
      {
        "role": "human2",
        "content": "Yes, and then we will return to the exam period"
      },
      {
        "role": "human1",
        "content": "Yes, and after each test we will go swimming in the sea"
      },
      {
        "role": "human2",
        "content": "Yes and then stamped in the material"
      },
      {
        "role": "human1",
        "content": "Yes, and we will get high marks"
      },
      {
        "role": "human2",
        "content": "Yes, and we will share a bribe"
      },
      {
        "role": "human1",
        "content": "Yes, and then we will really go free"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 117
  },
  {
    "id": "HH_65",
    "messages": [
      {
        "role": "human1",
        "content": "I remember a year ago we were at a crazy party in Las Vegas"
      },
      {
        "role": "human2",
        "content": "You must remember! We had a strong betting streak there"
      },
      {
        "role": "human1",
        "content": "Yes and we sat down at the roulette table and put all our money on 33 red"
      },
      {
        "role": "human2",
        "content": "Then 33 red came out and we won five million dollars"
      },
      {
        "role": "human1",
        "content": "Yes and we decided to take all the money and buy a huge yacht"
      },
      {
        "role": "human2",
        "content": "Then we went on a cruise around the USA that took about six months"
      },
      {
        "role": "human1",
        "content": "Yes and along the journey we met a mermaid who tried to sell us Bitcoin"
      },
      {
        "role": "human2",
        "content": "Yes, and then we had a party with them with all kinds of other fish and stuff"
      },
      {
        "role": "human1",
        "content": "Yeah and then the coast guard came and said this party was too cool and we should shut it down"
      },
      {
        "role": "human2",
        "content": "Then we returned to Israel and now we are here"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 143
  },
  {
    "id": "HH_66",
    "messages": [
      {
        "role": "human1",
        "content": "Yesterday we played rock paper and scissors"
      },
      {
        "role": "human2",
        "content": "Yes and I always won"
      },
      {
        "role": "human1",
        "content": "Yes, and I got really sad and decided to go out for a breath of fresh air"
      },
      {
        "role": "human2",
        "content": "Yes, and I came to apologize and offer you a cigarette"
      },
      {
        "role": "human1",
        "content": "Yes and it was the first time I smoked and since then I've been two packs in half a day"
      },
      {
        "role": "human2",
        "content": "Yes, and then we ended up in rehab together"
      },
      {
        "role": "human1",
        "content": "Yes, and the rehab institute was a synagogue"
      },
      {
        "role": "human2",
        "content": "Yes, and after dawn we took down statues with the help of women"
      },
      {
        "role": "human1",
        "content": "Yes, and then we got addicted to joints and went to rehab at the mosque"
      },
      {
        "role": "human2",
        "content": "Yes, and the mosque was on the Temple Mount"
      },
      {
        "role": "human1",
        "content": "Yes, and then we fell in love there and for years they secretly made a living as bridegrooms on the Temple Mount"
      },
      {
        "role": "human2",
        "content": "Yes, and then the third temple fell from the sky"
      },
      {
        "role": "human1",
        "content": "Yes, and they handed out a watermelon popsicle to everyone at the entrance on the occasion of the launch"
      },
      {
        "role": "human2",
        "content": "Yes and god said it is a pop up temple and closed it after seven days"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 182
  },
  {
    "id": "HH_67",
    "messages": [
      {
        "role": "human1",
        "content": "Yesterday it was snowing"
      },
      {
        "role": "human2",
        "content": "Yes and we went snowboarding"
      },
      {
        "role": "human1",
        "content": "Yes and I fell many times"
      },
      {
        "role": "human2",
        "content": "Yes and I took a video of one of the falls"
      },
      {
        "role": "human1",
        "content": "Yes and I got upset and yelled at you"
      },
      {
        "role": "human2",
        "content": "Yes and you got even more mad when I uploaded it to Facebook"
      },
      {
        "role": "human1",
        "content": "Yes and then I got so many likes that I really liked it"
      },
      {
        "role": "human2",
        "content": "Yes and it went viral and got to Ynet"
      },
      {
        "role": "human1",
        "content": "Yes, and I became a celebrity and was asked to host a talk show"
      },
      {
        "role": "human2",
        "content": "Yes and you were asked to show in the next Spider-Man Movie"
      },
      {
        "role": "human1",
        "content": "Yes and I invited you to be the bad guy - called snowMan"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 110
  },
  {
    "id": "HH_68",
    "messages": [
      {
        "role": "human1",
        "content": "Remember our holiday on campus?"
      },
      {
        "role": "human2",
        "content": "yes we made a Christmas tree together with our professor"
      },
      {
        "role": "human1",
        "content": "yes and gave to the professors many presents, from bronze"
      },
      {
        "role": "human2",
        "content": "yes and he gave us presents made from gold"
      },
      {
        "role": "human1",
        "content": "yes and then we realized that it's the basic of that holiday custom"
      },
      {
        "role": "human2",
        "content": "yes and we had to run to the shop to buy him better presents made from a special secret metal"
      },
      {
        "role": "human1",
        "content": "yes and I remember that this secret metal was invented in our classroom"
      },
      {
        "role": "human2",
        "content": "yes and it had a very cool property - it could talk"
      },
      {
        "role": "human1",
        "content": "yes and then you suggest to write patent on this talk"
      },
      {
        "role": "human2",
        "content": "yes and when we went to the patent office we met Albert Einstein"
      },
      {
        "role": "human1",
        "content": "yes and he told us about his rational holiday"
      },
      {
        "role": "human2",
        "content": "yes and we talked to him for hours, until it was dark outside"
      },
      {
        "role": "human1",
        "content": "yes and in the dark the secret metal started to shine"
      },
      {
        "role": "human2",
        "content": "yes and we followed the light coming from the metal - all the to the top of the mountain"
      },
      {
        "role": "human1",
        "content": "yes and on the top of the mountain the little Leprickon was so interested in the metal"
      },
      {
        "role": "human2",
        "content": "yes and we made a trade - we will give him the magical talking metal and he will give us a present fit for our professor"
      },
      {
        "role": "human1",
        "content": "yes and when we opened the present that he gave us, we saw the formula to happiness"
      },
      {
        "role": "human2",
        "content": "we are done :)"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 19,
    "num_words": 233
  },
  {
    "id": "HH_69",
    "messages": [
      {
        "role": "human1",
        "content": "Hi is anyone here?"
      },
      {
        "role": "human2",
        "content": "Then the chat partner changed to himself"
      },
      {
        "role": "human1",
        "content": "Employee?"
      },
      {
        "role": "human2",
        "content": "Gopher are you here with me?"
      },
      {
        "role": "human1",
        "content": "Yes, yes"
      },
      {
        "role": "human2",
        "content": "Then I did Zoom with a friend on programming"
      },
      {
        "role": "human1",
        "content": "Gopher are you here?"
      },
      {
        "role": "human2",
        "content": "Yes Yes"
      },
      {
        "role": "human1",
        "content": "Okay, come on, let's tell the story"
      }
    ],
    "num_messages": 9,
    "num_words": 42
  },
  {
    "id": "HH_70",
    "messages": [
      {
        "role": "human1",
        "content": "I remember we were together on the moon"
      },
      {
        "role": "human2",
        "content": "Yesterday I went to eat a hamburger"
      },
      {
        "role": "human1",
        "content": "Yes and we found a black cat there"
      },
      {
        "role": "human2",
        "content": "Yes, and we tried to protect him from the devil's scourge"
      },
      {
        "role": "human1",
        "content": "Yes and we didn't succeed because he was kidnapped by aliens from the cult"
      },
      {
        "role": "human2",
        "content": "Yeah and then we both jumped into their laser beam and got sucked into their spaceship"
      },
      {
        "role": "human1",
        "content": "Yes and they told us that if we agreed to be their slaves they would release the cat"
      },
      {
        "role": "human2",
        "content": "Yes and we told them there is no way, we have matriculation in citizenship next week"
      },
      {
        "role": "human1",
        "content": "Yes and then they said they would make sure we failed anyway"
      },
      {
        "role": "human2",
        "content": "Yes and we tried to convince them to release the cat because it was already getting late"
      },
      {
        "role": "human1",
        "content": "Yes, and then they found out he was actually a dog"
      },
      {
        "role": "human2",
        "content": "Yes, and then the dog started talking and saying that he was the scourge of the devil"
      },
      {
        "role": "human1",
        "content": "Yes, and then we found out that we were with the dog in the circle of the Satanic cult on another planet"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 178
  },
  {
    "id": "HH_71",
    "messages": [
      {
        "role": "human1",
        "content": "I want to go with you to Mexico"
      },
      {
        "role": "human2",
        "content": "yes and we can take my truck, it has a lot of space and a cat in it"
      },
      {
        "role": "human1",
        "content": "yes! I like that cat, especially for road trips"
      },
      {
        "role": "human2",
        "content": "yes and we can also bring other cats with us, maybe collect all the cats we see on the way"
      },
      {
        "role": "human1",
        "content": "thats a great idea! we can also ride on those cats, together"
      },
      {
        "role": "human2",
        "content": "yes and we can learn their language so we can communicate and work on our relationships"
      },
      {
        "role": "human1",
        "content": "yes and we can start new tribe and marry to all the cat-women"
      },
      {
        "role": "human2",
        "content": "yes and then we can create a new city full of cats and people living in harmony"
      },
      {
        "role": "human1",
        "content": "yes and we can add more animals to our city, like zeebras"
      },
      {
        "role": "human2",
        "content": "yes and we can start a program to search for more animals, under the sea, in the skies and even in space"
      },
      {
        "role": "human1",
        "content": "yes and we can build a new academy, to explore the relationships between all those kind of animals"
      },
      {
        "role": "human2",
        "content": "yes and we can finally bring peace between humans and the rest of the globe"
      },
      {
        "role": "human1",
        "content": "yes! make a place for everybody, even tomatos"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 189
  },
  {
    "id": "HH_72",
    "messages": [
      {
        "role": "human1",
        "content": "Yes and we met that handsome guy from Tinder"
      },
      {
        "role": "human2",
        "content": "Yes, and then he didn't understand why our grandmother came with us to Barka"
      },
      {
        "role": "human1",
        "content": "Yes and then he invited her for a drink"
      },
      {
        "role": "human2",
        "content": "Yes, and then she suggested that he come to Gahnon on Shabbat"
      },
      {
        "role": "human1",
        "content": "Yes, and then he got scared and ran away"
      },
      {
        "role": "human2",
        "content": "Yes, and then we were already tired"
      },
      {
        "role": "human1",
        "content": "Yes and also hungry so we went to pizza and fell asleep on the counter"
      },
      {
        "role": "human2",
        "content": "Yes, and then we woke up to the smell of the anchovies"
      },
      {
        "role": "human1",
        "content": "Yes, and we realized that we forgot grandma at the check-in"
      },
      {
        "role": "human2",
        "content": "Yes, and then we came back and saw that she was on the DJ stand"
      },
      {
        "role": "human1",
        "content": "Yes and we told her to go but she wanted to stay"
      },
      {
        "role": "human2",
        "content": "Yes, so we did another Caesar"
      },
      {
        "role": "human1",
        "content": "Yes, and that's why you threw up in the taxi on the way home"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 146
  },
  {
    "id": "HH_73",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we were at the sea?"
      },
      {
        "role": "human2",
        "content": "yes and, there were really strong waves"
      },
      {
        "role": "human1",
        "content": "Yes, and there was a surfer on one of the waves"
      },
      {
        "role": "human2",
        "content": "Yes, and the surfer was hairy"
      },
      {
        "role": "human1",
        "content": "Yes, and the surfer's hair was very long"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 6,
    "num_words": 41
  },
  {
    "id": "HH_74",
    "messages": [
      {
        "role": "human1",
        "content": "Who is?"
      },
      {
        "role": "human2",
        "content": ":)"
      },
      {
        "role": "human1",
        "content": "Whoa whoa"
      },
      {
        "role": "human2",
        "content": "Remember last week when we went skiing?"
      },
      {
        "role": "human1",
        "content": "yes and remember how bad I was?"
      },
      {
        "role": "human2",
        "content": "yes and then we tried to make it better by climbing on that high mountain"
      },
      {
        "role": "human1",
        "content": "yes and view was stunning"
      },
      {
        "role": "human2",
        "content": "yes and that bear showed up"
      },
      {
        "role": "human1",
        "content": "yes and thank god it did not chase us"
      },
      {
        "role": "human2",
        "content": "yes and remember that funny thing it did before it disappeared?"
      },
      {
        "role": "human1",
        "content": "yes and I also remember that other people saw this and laughed"
      },
      {
        "role": "human2",
        "content": "yes and then we all went together to the pub"
      },
      {
        "role": "human1",
        "content": "yes and than the bear turned out to be the bartender"
      },
      {
        "role": "human2",
        "content": "yes and that was the end!"
      },
      {
        "role": "human1",
        "content": ";)"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 106
  },
  {
    "id": "HH_75",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when Luigi drop the hammer"
      },
      {
        "role": "human2",
        "content": "Yes, and then we had no way to clean the stew pot"
      },
      {
        "role": "human1",
        "content": "Yes, and then we continued to cook in the pot and invented the secret of the family taste"
      },
      {
        "role": "human2",
        "content": "Yes and since then the recipe is written in the group description of the family WhatsApp"
      },
      {
        "role": "human1",
        "content": "Yes and it caused a conflict between Patricia who wrote the description and Luigi who wanted to keep the recipe a secret"
      },
      {
        "role": "human2",
        "content": "Yes, and then we had to accompany them to couples therapy"
      },
      {
        "role": "human1",
        "content": "Yes and their therapist advised them to yell at each other for five minutes a day twice a week"
      },
      {
        "role": "human2",
        "content": "Yes and they decided that the best time to do it was right when the rabbi was holding the scissors in the berit last week"
      },
      {
        "role": "human1",
        "content": "Yes, and the Christian rabbi agreed and emphasized that a hug also helps"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 143
  },
  {
    "id": "HH_76",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we were at the game two weeks ago?"
      },
      {
        "role": "human2",
        "content": "Yes and everyone in the crowd was wearing pink clothes"
      },
      {
        "role": "human1",
        "content": "Yes and the players did not understand why because it is not the color of any of the teams"
      },
      {
        "role": "human2",
        "content": "Yes, and then the referee explained to them that it was in honor of the unicorn who would come to perform at halftime"
      },
      {
        "role": "human1",
        "content": "Yes, and then at halftime a donkey arrived that was painted purple"
      },
      {
        "role": "human2",
        "content": "Yes, and it turned out to be Shrek's donkey"
      },
      {
        "role": "human1",
        "content": "Yes, and then Pninaa Rosenblum also came"
      },
      {
        "role": "human2",
        "content": "Yes and she washed the donkey with her new shampoo"
      },
      {
        "role": "human1",
        "content": "Yes and then people started yelling at her because her products say they are not tested on animals"
      },
      {
        "role": "human2",
        "content": "Yes and then the players tried to calm them down to continue the game"
      },
      {
        "role": "human1",
        "content": "Yes and then the second half started"
      },
      {
        "role": "human2",
        "content": "Yes, and they scored some 5 goals"
      },
      {
        "role": "human1",
        "content": "Yes, and then the commentator said that exiles score and don't score"
      },
      {
        "role": "human2",
        "content": "Yes and then I told him stream it's a new game that the unicorn invented"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 173
  },
  {
    "id": "HH_77",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that two years ago we went to the final of the champions together?"
      },
      {
        "role": "human2",
        "content": "Yes and you ate kernels with yourself"
      },
      {
        "role": "human1",
        "content": "Yes, and then suddenly a sunflower started growing in my stomach"
      },
      {
        "role": "human2",
        "content": "Yes hahahaha"
      },
      {
        "role": "human1",
        "content": "Wow all these men same shit"
      },
      {
        "role": "human2",
        "content": "Yes, and all women are different and unique"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 7,
    "num_words": 49
  },
  {
    "id": "HH_78",
    "messages": [
      {
        "role": "human1",
        "content": "what is going on? Remember we sat down for a beer in the sea?"
      },
      {
        "role": "human2",
        "content": "Sure enough, the head brewer came to us"
      },
      {
        "role": "human1",
        "content": "Yes, and then he suggested that we become his partners and start a business"
      },
      {
        "role": "human2",
        "content": "Yes and we told him that we demand milk instead of money"
      },
      {
        "role": "human1",
        "content": "Yes, and then we took all the milk and made Malabii to the masses from it"
      },
      {
        "role": "human2",
        "content": "Yes, and with Malabi's help, we managed to bring enough people to a 20-meter-high human pyramid"
      },
      {
        "role": "human1",
        "content": "Yes, and then the Egyptians got mad at us for surpassing them in the Guinness record of the pyramids"
      },
      {
        "role": "human2",
        "content": "Yes, and it caused a terrible war and they demanded all of our hearts"
      },
      {
        "role": "human1",
        "content": "Yes, and to avoid a serious diplomatic crisis, we gave them the Melbi and in return we received the title of sheikh"
      },
      {
        "role": "human2",
        "content": "Yes and we have been living happily ever after"
      },
      {
        "role": "human1",
        "content": "Absolutely"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 146
  },
  {
    "id": "HH_79",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last year we were on a desert island?"
      },
      {
        "role": "human2",
        "content": "Yes, it was a stunning island. There were lots of beautiful plants but we had nothing to eat because they were poisonous"
      },
      {
        "role": "human1",
        "content": "Yes and we started thinking about how we could survive on this island without eating plants, then I suggested that we extract food from the sand"
      },
      {
        "role": "human2",
        "content": "So we started building sand cakes in the shapes of food to console ourselves"
      },
      {
        "role": "human1",
        "content": "Yes, I remember! Then you waved your magic wand and tried to turn it into real food"
      },
      {
        "role": "human2",
        "content": "Right, and I couldn't do anything. But then a magician came and took the stick!"
      },
      {
        "role": "human1",
        "content": "Yes! Then he tried to show us the magic where he raises the stick into his mouth...but because the stick grew on the island so the magician died"
      },
      {
        "role": "human2",
        "content": "Yes, and then we wondered if we should eat him because we were terribly hungry, but he ate poison"
      },
      {
        "role": "human1",
        "content": "Yeah, so we started checking first if we could eat his clothes, then you found an energy bar there"
      },
      {
        "role": "human2",
        "content": "We divided it into small pieces and managed to live on it for a whole week"
      },
      {
        "role": "human1",
        "content": "Yes, and I remember that it came out exactly on the Hanukkah holiday, and we prayed that we could survive even to the eighth day"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 211
  },
  {
    "id": "HH_80",
    "messages": [
      {
        "role": "human1",
        "content": "Have you seen the new music video for the Tzell Static and Ben-El?"
      },
      {
        "role": "human2",
        "content": "Yes how crazy how did they bring a flying car with airplane wings"
      },
      {
        "role": "human1",
        "content": "Yes, and knock Sarit Hadad shit on the head"
      },
      {
        "role": "human2",
        "content": "Yes, and she shouted, \"Go atone for me\" and instead he kissed her feet! Puja"
      },
      {
        "role": "human1",
        "content": "Yes and then he became her Abadi"
      },
      {
        "role": "human2",
        "content": "Yes, and she called Zvika Pick to come eat Abadi with her"
      },
      {
        "role": "human1",
        "content": "Yes and because he is so old, he couldn't give a bite"
      },
      {
        "role": "human2",
        "content": "Yes, and Sarit told him that orange flatters him, she's like Noa - she likes yellow"
      },
      {
        "role": "human1",
        "content": "yes and then because they got tired of talking so they went home (:"
      },
      {
        "role": "human2",
        "content": "Yes, in the flying car from the music video"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 121
  },
  {
    "id": "HH_81",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last year when we flew to the moon?"
      },
      {
        "role": "human2",
        "content": "Yes and we had a party in a spaceship with monkeys in spacesuits"
      },
      {
        "role": "human1",
        "content": "Yes, even Brad Pitt was! And one other book.. 12 monkeys!"
      },
      {
        "role": "human2",
        "content": "Yes and I asked for an autograph but he didn't agree and in the end we opened a poker table"
      },
      {
        "role": "human1",
        "content": "Yes, and because he's good at sketching, he doesn't wear sunglasses at all"
      },
      {
        "role": "human2",
        "content": "Yes, and the performance of the dancing cats made a big mess there"
      },
      {
        "role": "human1",
        "content": "Yes and it was so loud that all the mice turned pink"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 8,
    "num_words": 92
  },
  {
    "id": "HH_82",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that time when aliens landed?"
      },
      {
        "role": "human2",
        "content": "yes and there was a big green explosion"
      },
      {
        "role": "human1",
        "content": "yes and that gas started to appear"
      },
      {
        "role": "human2",
        "content": "yes and it was hard to see"
      },
      {
        "role": "human1",
        "content": "yes and we all coughed"
      },
      {
        "role": "human2",
        "content": "yes and then the old lady split"
      },
      {
        "role": "human1",
        "content": "yes and she was probably the smartest among us"
      },
      {
        "role": "human2",
        "content": "yes and they had three eyes"
      },
      {
        "role": "human1",
        "content": "yes and that wasn't the weirdest thing about them"
      },
      {
        "role": "human2",
        "content": "yes and they had only pinkies in their hand"
      },
      {
        "role": "human1",
        "content": "yes in all 5 hands! 28 pinkies!!"
      },
      {
        "role": "human2",
        "content": "yes and there were many flowers everywhere"
      },
      {
        "role": "human1",
        "content": "yes and the aliens were really interested in the flowers for some reason..."
      },
      {
        "role": "human2",
        "content": "yes and there were flowers and flours"
      },
      {
        "role": "human1",
        "content": "yes and floors. All the buildings nearby had floors"
      },
      {
        "role": "human2",
        "content": "yes and it was all in Asi and Guri standup https://www.youtube.com/watch?v=UzJPxXQnZnc"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 128
  },
  {
    "id": "HH_83",
    "messages": [
      {
        "role": "human1",
        "content": "Fifty years ago we were traveling together in the Sahara desert"
      },
      {
        "role": "human2",
        "content": "Yes and 43 camels rode us"
      },
      {
        "role": "human1",
        "content": "Yes, and our backs hurt a little, but nothing terrible"
      },
      {
        "role": "human2",
        "content": "Yes, and all the time we were looking for water"
      },
      {
        "role": "human1",
        "content": "Yes, and suddenly in front of us we will discover a beautiful oasis"
      },
      {
        "role": "human2",
        "content": "Yes, and in the end we found out that it was all an illusion"
      },
      {
        "role": "human1",
        "content": "Yes and we started to cry and the pups also started to cry along with us"
      },
      {
        "role": "human2",
        "content": "Yes, and then we decided to sell them and fly back"
      },
      {
        "role": "human1",
        "content": "Yes, and when we arrived we were millionaires from all the camels we sold"
      },
      {
        "role": "human2",
        "content": "Yes, and we went to the sea to look for the popsicle seller"
      },
      {
        "role": "human1",
        "content": "Yes, and then he tried to sell me a selfie stick for a cell phone"
      },
      {
        "role": "human2",
        "content": "Yes, and then he asked us to help him carry a lot of things to his car"
      },
      {
        "role": "human1",
        "content": "Yes and we told him we would help him in exchange for a chocolate banana popsicle"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 167
  },
  {
    "id": "HH_84",
    "messages": [
      {
        "role": "human1",
        "content": "I remember a month ago that we drank water from the lake"
      },
      {
        "role": "human2",
        "content": "Yes! And remember who was next to us?"
      },
      {
        "role": "human1",
        "content": "Yes it was the hypothalamus that trades stocks"
      },
      {
        "role": "human2",
        "content": "Yes, and he didn't stop bragging about the issue of his wife the elephant"
      },
      {
        "role": "human1",
        "content": "Yes and he almost convinced us to invest in his wife's pyramid stock"
      },
      {
        "role": "human2",
        "content": "Yes, and you told him \"there is no entrance for elephants in this house\".. He did not take it well"
      },
      {
        "role": "human1",
        "content": "Yes and we were accused of racism towards elephants, it made the news"
      },
      {
        "role": "human2",
        "content": "Yes, and covered the issue in the entire galaxy! Even my friends on Mars"
      },
      {
        "role": "human1",
        "content": "Yes and they lived happily ever after"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 10,
    "num_words": 110
  },
  {
    "id": "HH_85",
    "messages": [
      {
        "role": "human1",
        "content": "hey remember when you and I adopted a robot dog?"
      },
      {
        "role": "human2",
        "content": "yes and the dog was so smart it could fetch and play chess in grand master levels"
      },
      {
        "role": "human1",
        "content": "yes and it had literal balls of steel"
      },
      {
        "role": "human2",
        "content": "yes and he would play fetch with them every day, after winning in a game against Gary Kasparov"
      },
      {
        "role": "human1",
        "content": "yes and gary was always happy to lose because he came from the reverse world"
      },
      {
        "role": "human2",
        "content": "yes and we would go out dancing in the reverse world, meaning we would sit in chairs there"
      },
      {
        "role": "human1",
        "content": "yes and the chairs loved us sitting on them because there it would mean they are sitting on us"
      },
      {
        "role": "human2",
        "content": "yes and we would cry and run away because it was scary even if it was reverse"
      },
      {
        "role": "human1",
        "content": "yes and the robot dog always cheered us when we came back"
      },
      {
        "role": "human2",
        "content": "yes and he would pick us up from school"
      },
      {
        "role": "human1",
        "content": "yes and we would ride hime all the way back home"
      },
      {
        "role": "human2",
        "content": "yes and on the way we would stop for ice cream"
      },
      {
        "role": "human1",
        "content": "yes and we would buy car oil for him too"
      },
      {
        "role": "human2",
        "content": "yes and over time he gained weight from all the oil"
      },
      {
        "role": "human1",
        "content": "yes and we had to take him to eat at the reverse world so he would lose weight"
      },
      {
        "role": "human2",
        "content": "yes and he got in shape and became the fastest robo-dog in the known universe"
      },
      {
        "role": "human1",
        "content": "yes and we would be jealous of him on sunday morning races"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 232
  },
  {
    "id": "HH_86",
    "messages": [
      {
        "role": "human1",
        "content": "Did you see there is a sale on chicken in the supermarket?"
      },
      {
        "role": "human2",
        "content": "Yes! It only costs 1500 Shekels, that's amazing!"
      },
      {
        "role": "human1",
        "content": "Yes, and I just wanted to make Shabbat soup like a good Ashkenazi"
      },
      {
        "role": "human2",
        "content": "There's nothing like chicken soup, remember we made it a week ago?"
      },
      {
        "role": "human1",
        "content": "Yes, and then we were in Stella swords from the Faisal you rolled"
      },
      {
        "role": "human2",
        "content": "My puzzles also knock down horses. I remember you thought I was a sheep for a moment"
      },
      {
        "role": "human1",
        "content": "Yes, and for a moment I tried to make you a sweater, but suddenly I realized that it was your hair after all"
      },
      {
        "role": "human2",
        "content": "You may not remember but you managed to make the sweater. now i'm bald"
      },
      {
        "role": "human1",
        "content": "The truth is that I forgot, it's good that you reminded me, you were also completely stoned in the evening"
      },
      {
        "role": "human2",
        "content": "Yes I ate so much afterwards I couldn't move. You should have dragged me home"
      },
      {
        "role": "human1",
        "content": "Yes, and the sweater I made from you got really dirty"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 159
  },
  {
    "id": "HH_87",
    "messages": [
      {
        "role": "human1",
        "content": "examination"
      },
      {
        "role": "human2",
        "content": "there is. Employee"
      },
      {
        "role": "human1",
        "content": "Shall we begin?"
      },
      {
        "role": "human2",
        "content": "Come on whip"
      },
      {
        "role": "human1",
        "content": "Remember the time we went to the zoo?"
      },
      {
        "role": "human2",
        "content": "Yes and that was the time I skated by the penguin pool"
      },
      {
        "role": "human1",
        "content": "Yes and then the seal that happened to be there dragged you into the water because he wanted to play."
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 8,
    "num_words": 51
  },
  {
    "id": "HH_88",
    "messages": [
      {
        "role": "human1",
        "content": "I remember that yesterday we went to play football and suddenly Shlomi joined ðŸ˜³"
      },
      {
        "role": "human2",
        "content": "Yes.. and he suddenly started beating my father"
      },
      {
        "role": "human1",
        "content": "Yes!!!! And this father, so crazy, Flaum decided he wanted to play basketball ðŸ€ðŸ€ðŸ€"
      },
      {
        "role": "human2",
        "content": "Yes! And I didn't understand how he could play basketball when Shlomi was beating him"
      },
      {
        "role": "human1",
        "content": "Completely! I stood there in shock too! He probably studied martial arts all his childhoodâ€¦.."
      },
      {
        "role": "human2",
        "content": "Yes, and later my father's mother got angry about my health"
      },
      {
        "role": "human1",
        "content": "Wow, that was amazing!!!! His mother is so obsessed with him, she got angry with disgusting intensity ðŸ˜ðŸ˜ðŸ˜ðŸ¥² Shlomi is not guilty at all"
      },
      {
        "role": "human2",
        "content": "Yes!!! And I didn't understand why she came suddenly, we are 27 years old, we passed the same age already...."
      },
      {
        "role": "human1",
        "content": "Free we passed the age! This is already an age where we have to scream at our children ðŸ¤¨"
      },
      {
        "role": "human2",
        "content": "Yes, yes!!! And also beat them a little"
      },
      {
        "role": "human1",
        "content": "yes and preach them morals"
      },
      {
        "role": "human2",
        "content": "Yes!! and ask them what they want to do in life"
      },
      {
        "role": "human1",
        "content": "Yes!!!!! Maybe even scream at them: be senior managers!!!!!"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 174
  },
  {
    "id": "HH_89",
    "messages": [
      {
        "role": "human1",
        "content": "Remember a year ago when we learned modern dance?"
      },
      {
        "role": "human2",
        "content": "Yes and you were quite the star there"
      },
      {
        "role": "human1",
        "content": "Yes, and the teacher taught us in lessons into the night, where we started together"
      },
      {
        "role": "human2",
        "content": "Yes, and then came this strange fairy, remember?"
      },
      {
        "role": "human1",
        "content": "Yes, and the fairy offered us a year's vacation in Europe or a 5-minute visit to the moon"
      },
      {
        "role": "human2",
        "content": "Yes, I chose 5 minutes on the moon, and in general I received 10 years of imprisonment in a Vietnamese prison"
      },
      {
        "role": "human1",
        "content": "Yes and every day I would smuggle dim sums and yellow curry to you with the help of my connections"
      },
      {
        "role": "human2",
        "content": "Yes, and the magic powder that was there, didn't get me into any trouble with the police"
      },
      {
        "role": "human1",
        "content": "Yes, and when we smelled the magic powder we learned the most important secret in secret history"
      },
      {
        "role": "human2",
        "content": "Yes and then that was when we met mom"
      },
      {
        "role": "human1",
        "content": "Yes, and it turns out we weren't the only fathers"
      },
      {
        "role": "human2",
        "content": "Yes, and in the end I even got a fail in this course"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 166
  },
  {
    "id": "HH_90",
    "messages": [
      {
        "role": "human1",
        "content": "I start?"
      },
      {
        "role": "human2",
        "content": "so"
      },
      {
        "role": "human1",
        "content": "Remember we were at summer camp together?"
      },
      {
        "role": "human2",
        "content": "Yes, and I broke my arm on the slide"
      },
      {
        "role": "human1",
        "content": "Yes, and then we took you to the camp clinic, and you got a nail in your sandal"
      },
      {
        "role": "human2",
        "content": "Yes, and they gave me a tetanus shot"
      },
      {
        "role": "human1",
        "content": "Yeah, and then we got back really late at night for everyone"
      },
      {
        "role": "human2",
        "content": "Yes and I told you not to use a comma after the yes"
      },
      {
        "role": "human1",
        "content": "Yes, and then I didn't listen"
      },
      {
        "role": "human2",
        "content": "Yes and I told you that Gal will be disappointed and cry and it will be unpleasant for no one"
      },
      {
        "role": "human1",
        "content": "Yes, and then we went to Gal together and drank a lot of wine"
      },
      {
        "role": "human2",
        "content": "Yes and there were chia seeds in the wine"
      },
      {
        "role": "human1",
        "content": "Yes and curcumin too"
      },
      {
        "role": "human2",
        "content": "Yes, and we joked about the wine seasoning being more suitable for rice"
      },
      {
        "role": "human1",
        "content": "Yes and Grandma Rita said she agrees too"
      },
      {
        "role": "human2",
        "content": "Yes, and I was really surprised that Grandma Rita was here and not in Luna Gal"
      },
      {
        "role": "human1",
        "content": "Yes, and then we found out that Luna Gal was closed and now she mainly spends time at Bimit 2000"
      },
      {
        "role": "human2",
        "content": "Yeah and then she decided to throw plastic chairs at everyone"
      },
      {
        "role": "human1",
        "content": "Yes, and then they took her out of the wave pool"
      },
      {
        "role": "human2",
        "content": "Yes, and then we decided that Grandma Rita is actually a dinosaur and we are in a dream"
      },
      {
        "role": "human1",
        "content": "Yes and then it's over"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 22,
    "num_words": 226
  },
  {
    "id": "HH_91",
    "messages": [
      {
        "role": "human1",
        "content": "What is this? Remember we went to Paul Trank's concert two weeks ago?"
      },
      {
        "role": "human2",
        "content": "Yes, and then we saw the handsome Gal Nisman there"
      },
      {
        "role": "human1",
        "content": "Yes, and then he invited us to a beer after the show"
      },
      {
        "role": "human2",
        "content": "Yes, and then we sat together at Bir Bazaar"
      },
      {
        "role": "human1",
        "content": "Yes, and then Shalom Hanoch arrived and they started playing and singing together"
      },
      {
        "role": "human2",
        "content": "Yes, and then the whole place started shouting - Messiah did not come, and then Udi Kagan came"
      },
      {
        "role": "human1",
        "content": "Yes, and then a joint performance of all three began in tribute to Queen"
      },
      {
        "role": "human2",
        "content": "Yes and then we got tired of them and went to eat"
      },
      {
        "role": "human1",
        "content": "Yes, and then we debated whether hummus or pizza and in the end we agreed on knapa and then Melbi"
      },
      {
        "role": "human2",
        "content": "Yeah and then I came home and ordered a burger at Walt because I was hungry"
      },
      {
        "role": "human1",
        "content": "Yes and I ordered shawarma for exactly the same reason"
      },
      {
        "role": "human2",
        "content": "So? Shall we go to another show?"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 155
  },
  {
    "id": "HH_92",
    "messages": [
      {
        "role": "human1",
        "content": "remember last week when we went skiing?"
      },
      {
        "role": "human2",
        "content": "yes, and you remember the bad weather we had?"
      },
      {
        "role": "human1",
        "content": "yes, and we didn't find a place to hide from the sand storm"
      },
      {
        "role": "human2",
        "content": "yes, and the great beer we drank on the top of the mountain"
      },
      {
        "role": "human1",
        "content": "yes, and i got drunk and thought it would be a good idea to snowboard while hand standing"
      },
      {
        "role": "human2",
        "content": "yes, and we had a long day at the clinic the next day"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 7,
    "num_words": 74
  },
  {
    "id": "HH_93",
    "messages": [
      {
        "role": "human1",
        "content": "Remember I had gender reassignment surgery last week?"
      },
      {
        "role": "human2",
        "content": "Yes and the doctor's penis fell into the sandwich"
      },
      {
        "role": "human1",
        "content": "Yes and it was a real shame because I wanted to keep it in a blue jar"
      },
      {
        "role": "human2",
        "content": "Yes, and the Hatzel Museum spoke to us so that they could display the jar"
      },
      {
        "role": "human1",
        "content": "Yes, and there were many other members of all kinds of heroes of the legendary underground"
      },
      {
        "role": "human2",
        "content": "Yes, and every day thousands of children around the world learn about these heroic organs"
      },
      {
        "role": "human1",
        "content": "Yes and in addition to everything it's really nice to be a girl! Try it once"
      },
      {
        "role": "human2",
        "content": "Yes, and today in schools they teach how to be boys and girls - everyone what they want"
      },
      {
        "role": "human1",
        "content": "Yes, and the teacher doesn't even know what his gender is"
      },
      {
        "role": "human2",
        "content": "Yes, and the teacher doesn't even know what his own gender is - because they vote for him in the morning"
      },
      {
        "role": "human1",
        "content": "Yes, and he has to undergo removal/implantation of the organ every day... this part is not pleasant"
      },
      {
        "role": "human2",
        "content": "Yes and he does it out of a sense of mission"
      },
      {
        "role": "human1",
        "content": "Yes, and also from a sense of leadership"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 183
  },
  {
    "id": "HH_94",
    "messages": [
      {
        "role": "human1",
        "content": "Hi"
      },
      {
        "role": "human2",
        "content": "Hello"
      },
      {
        "role": "human1",
        "content": "Remember last week when you went skiing?"
      },
      {
        "role": "human2",
        "content": "Yes and the weather was very nice"
      },
      {
        "role": "human1",
        "content": "yes and we saw amazing landscapes"
      },
      {
        "role": "human2",
        "content": "yes and everything was colored in white"
      },
      {
        "role": "human1",
        "content": "yes and we had a great meal"
      },
      {
        "role": "human2",
        "content": "yes and the desert was also great"
      },
      {
        "role": "human1",
        "content": "yes and I did snowboarding for the first time, it was, wait for it, legendery!"
      },
      {
        "role": "human2",
        "content": "yes and you know what else was legendary? the hot pockets"
      },
      {
        "role": "human1",
        "content": "yes we had a great time, we should do it again soon"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 82
  },
  {
    "id": "HH_95",
    "messages": [
      {
        "role": "human1",
        "content": "Yesterday we went to a party and it was really fun"
      },
      {
        "role": "human2",
        "content": "Yes, and we saw Lior there"
      },
      {
        "role": "human1",
        "content": "And we danced folk dances with him"
      },
      {
        "role": "human2",
        "content": "Yes, and we wore a sparkly skirt"
      },
      {
        "role": "human1",
        "content": "Yes, and then we went to a restaurant together"
      },
      {
        "role": "human2",
        "content": "And we drank apple cider"
      },
      {
        "role": "human1",
        "content": "Then the spacecraft took us into space"
      },
      {
        "role": "human2",
        "content": "Yes and we saw a hovering alien with purple eyes"
      },
      {
        "role": "human1",
        "content": "And the alien also had a sparkly skirtâœ¨"
      },
      {
        "role": "human2",
        "content": "Yes and he also belly danced"
      },
      {
        "role": "human1",
        "content": "And we danced folk dances around him"
      },
      {
        "role": "human2",
        "content": "Yes, and then more aliens joined us"
      },
      {
        "role": "human1",
        "content": "And we went with them on a tour of their people museum"
      },
      {
        "role": "human2",
        "content": "Yes and then they took us on a tour in a huge spaceship"
      },
      {
        "role": "human1",
        "content": "Yes and then we had a party in a spaceship"
      },
      {
        "role": "human2",
        "content": "Yes and then we decided to fly with them to another planet"
      },
      {
        "role": "human1",
        "content": "Yes and on the other planet we found more people stuck there"
      },
      {
        "role": "human2",
        "content": "Yes, and we picked them up on the way back to Israel"
      },
      {
        "role": "human1",
        "content": "Then we found out that it was all Lior's plan to bring people to an experiment in space"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 20,
    "num_words": 180
  },
  {
    "id": "HH_96",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we wanted to find out what's beyond Antarctica?"
      },
      {
        "role": "human2",
        "content": "Yes and we got stuck with the boat in the ice and almost froze to death"
      },
      {
        "role": "human1",
        "content": "Yes luckily we ran into some Eskimos who helped us warm up"
      },
      {
        "role": "human2",
        "content": "Yes and we had a salsa party and drank a lot"
      },
      {
        "role": "human1",
        "content": "Yes, it was a little difficult for me at first to drink the blood of penguins, but it seems that there was a murder on it"
      },
      {
        "role": "human2",
        "content": "Yes, and the blood was not enough to survive.. and I killed one of the Asikomas because there was nothing left to eat"
      },
      {
        "role": "human1",
        "content": "Yes, it was very strange for me to cover myself with his skin after that, but that's what helped us continue"
      },
      {
        "role": "human2",
        "content": "Yes, in the end we discovered that the earth is not flat"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 9,
    "num_words": 132
  },
  {
    "id": "HH_97",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week we were at the zoo?"
      },
      {
        "role": "human2",
        "content": "Yes, and we saw a wedding of two giraffes"
      },
      {
        "role": "human1",
        "content": "Yes, and you read the seven blessings"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 4,
    "num_words": 25
  },
  {
    "id": "HH_98",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we were captains of a spacecraft?"
      },
      {
        "role": "human2",
        "content": "yes and I also remember Lieutenant Guy"
      },
      {
        "role": "human1",
        "content": "yes we were the first captains and lieutenant to crash a ship"
      },
      {
        "role": "human2",
        "content": "yes and we needed to pay big debt with our leftovers"
      },
      {
        "role": "human1",
        "content": "yes I remember, the galactic government made us give them all of our schnitzel leftovers as punishment"
      },
      {
        "role": "human2",
        "content": "yes and then they made more asteroids from those schnitzels"
      },
      {
        "role": "human1",
        "content": "yes and everyone wanted to fly to those asteroids to meet the schnitzel people who live on them"
      },
      {
        "role": "human2",
        "content": "yes so we bought 3 cards for that meeting"
      },
      {
        "role": "human1",
        "content": "yes and we went to the meeting and found out there are no people, it was a trap to make us pay with even more schnitzels!"
      },
      {
        "role": "human2",
        "content": "yes and then we got really med, and started to jump"
      },
      {
        "role": "human1",
        "content": "yes and we jumped so high that we fell into a black hole"
      },
      {
        "role": "human2",
        "content": "yes and the universe colapsed with us into that hole"
      },
      {
        "role": "human1",
        "content": "yes and on the other side we met the schnitzel people we looked for"
      },
      {
        "role": "human2",
        "content": "yes and we asked them to give us our schnitzel and also new spacecraft"
      },
      {
        "role": "human1",
        "content": "yes and they gave us what we asked for, it was delicious but it was all made of schnitzel so it didn't work"
      },
      {
        "role": "human2",
        "content": "Yes and decided to leave them, with empty hands we went back to our families"
      },
      {
        "role": "human1",
        "content": "Another good ending"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 222
  },
  {
    "id": "HH_99",
    "messages": [
      {
        "role": "human1",
        "content": "What's going on ? Remember when we went to eat a hamburger at the International Space Station?"
      },
      {
        "role": "human2",
        "content": "Yes and what crazy additions"
      },
      {
        "role": "human1",
        "content": "Yes, and then my stomach hurt because I accidentally ate with jock extra"
      },
      {
        "role": "human2",
        "content": "Yes and the guk was one of those with the wings that fly how delicious it is"
      },
      {
        "role": "human1",
        "content": "Yes, one of the delicious ones, and then we continued from there to China's secret space station"
      },
      {
        "role": "human2",
        "content": "It was scary there"
      },
      {
        "role": "human1",
        "content": "Yes, and these Chinese speak Chinese all day"
      },
      {
        "role": "human2",
        "content": "Yes, what is their problem? Why is it so difficult to speak Hebrew? Even aliens speak Hebrew"
      },
      {
        "role": "human1",
        "content": "Yes and when will they come to visit Israel"
      },
      {
        "role": "human2",
        "content": "The aliens are on the way so I understood. They just need permission from the Rabbis"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 124
  },
  {
    "id": "HH_100",
    "messages": [
      {
        "role": "human1",
        "content": "Do you remember when we were in Nachalat Binyamin and we met a crocodile?"
      },
      {
        "role": "human2",
        "content": "Yes, and we tried to put him on a saddle and sit him on a stool"
      },
      {
        "role": "human1",
        "content": "Yes and he started raging there and kicked the old woman off her camel"
      },
      {
        "role": "human2",
        "content": "Yes, and then the Prime Minister of Egypt came to save her"
      },
      {
        "role": "human1",
        "content": "Yes, and his security guard apologized to them"
      },
      {
        "role": "human2",
        "content": "Yes and everyone sat down in a circle around and started singing songs"
      },
      {
        "role": "human1",
        "content": "Yes and then it started snowing"
      },
      {
        "role": "human2",
        "content": "Yes and we tried to make angels in the snow"
      },
      {
        "role": "human1",
        "content": "Yes, and the crocodile tried to make a centipede in the snow"
      },
      {
        "role": "human2",
        "content": "Yes and he tried to eat the people but realized they were really not tasty"
      },
      {
        "role": "human1",
        "content": "Yes, and then the old woman's camel explained to him about veganism"
      },
      {
        "role": "human2",
        "content": "Yes and the crocodile told him that he is on a diet now and it is less suitable for him"
      },
      {
        "role": "human1",
        "content": "Yes, and then the old woman made a chicken coop for dietary pancakes and the king of Egypt wanted too"
      },
      {
        "role": "human2",
        "content": "Yes, and they opened a table of happiness with many delicacies and drinks"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 186
  },
  {
    "id": "HH_101",
    "messages": [
      {
        "role": "human1",
        "content": "Saul"
      },
      {
        "role": "human2",
        "content": "Today I was on the moon and I saw an alien drinking coffee"
      },
      {
        "role": "human1",
        "content": "Yes, and what kind of dress did he wear?"
      },
      {
        "role": "human2",
        "content": "He wore a white dress with black stripes"
      },
      {
        "role": "human1",
        "content": "Yes and the truth is that it reminded me of the zebras from my garden at home"
      },
      {
        "role": "human2",
        "content": "Yes, and they were together later at the supermarket and ordered a cheese board"
      },
      {
        "role": "human1",
        "content": "Yes and believe me this whole cheese thing is overrated"
      },
      {
        "role": "human2",
        "content": "Yes, especially the cheeses with the holes because mice from the Netherlands live there"
      },
      {
        "role": "human1",
        "content": "Yes, and precisely the mice themselves, so they actually go well with white wine"
      },
      {
        "role": "human2",
        "content": "Yes it is known that mice and mutts like white wine and tulip flowers"
      },
      {
        "role": "human1",
        "content": "I heard that tulips come in many colors in the world"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 126
  },
  {
    "id": "HH_102",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that Shlomit built a sukkah on Yom Kippur?"
      },
      {
        "role": "human2",
        "content": "Yes, what a crazy party there was in her sukkah"
      },
      {
        "role": "human1",
        "content": "Yes, and the neighbors called the police and the fire department arrived with confetti instead"
      },
      {
        "role": "human2",
        "content": "Yes and Shlomit got drunk and tried to start with one of the firefighters"
      },
      {
        "role": "human1",
        "content": "Yes and Dabosh spilled a glass of tahini on her and she was very embarrassed"
      },
      {
        "role": "human2",
        "content": "Then Dabus put on music and everyone started dancing and forgot Shlomit"
      },
      {
        "role": "human1",
        "content": "Then Miko played Romanian folk music and people started getting angry"
      },
      {
        "role": "human2",
        "content": "Yes, and it developed into a fight between Debosh and Miko, but no one has a chance against Miko"
      },
      {
        "role": "human1",
        "content": "Yes and mercifully the guard tried to separate them but he drank so much tahini that he couldn't"
      },
      {
        "role": "human2",
        "content": "Yes and then Joe Exotic came and started singing"
      },
      {
        "role": "human1",
        "content": "Yes, and then we started debating whether turquoise suits him better than mesh clothes"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 147
  },
  {
    "id": "HH_103",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last year we were in Greece?"
      },
      {
        "role": "human2",
        "content": "Yes and we lay on the beach and ate cheese"
      },
      {
        "role": "human1",
        "content": "Yes and then the sun melted our cheese and we started drinking it"
      },
      {
        "role": "human2",
        "content": "Yes and we got crazy heartburn from the cheese juice"
      },
      {
        "role": "human1",
        "content": "Yes, and then we started coughing, we coughed so hard that the seller of the kiosk came out to us"
      },
      {
        "role": "human2",
        "content": "Yes and he offered us cucumber water"
      },
      {
        "role": "human1",
        "content": "Yes and I thought it was a nice idea to drink the juice with gin"
      },
      {
        "role": "human2",
        "content": "Yes and he ran out of gin so he offered a strange and unknown liquid"
      },
      {
        "role": "human1",
        "content": "Yeah and then we thought it would be nice to go to an area that didn't have these weird things, so we went to Mars"
      },
      {
        "role": "human2",
        "content": "Yes and Elon Musk built a casino there so we went to gamble"
      },
      {
        "role": "human1",
        "content": "And unfortunately...we bet on the wrong horse"
      },
      {
        "role": "human2",
        "content": "Yes, and then the horse decided to kick everyone because he was angry that we bet on him"
      },
      {
        "role": "human1",
        "content": "Wow I remember that! Then you thought to take control of him...so you jumped on his back in the middle of all the commotion..in front of everyone"
      },
      {
        "role": "human2",
        "content": "on the horse's back*"
      },
      {
        "role": "human1",
        "content": "Yes and I told you to keep the format of \"yes and\" but I'm not sure you heard me about the galloping horse"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 215
  },
  {
    "id": "HH_104",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we used to have a pink cat?"
      },
      {
        "role": "human2",
        "content": "Yes and he had heartburn all the time"
      },
      {
        "role": "human1",
        "content": "Yes and the sausages we brought him made his joints tender"
      },
      {
        "role": "human2",
        "content": "Yes and he would always run away from home and come back reeking of whiskey"
      },
      {
        "role": "human1",
        "content": "Yes and he had a chubby friend with a lazy eye who was sensitive to milk"
      },
      {
        "role": "human2",
        "content": "Yes and this chubby friend was married to the most famous cat in the world"
      },
      {
        "role": "human1",
        "content": "Yes and she promised to take him on a trip around Yemen next July"
      },
      {
        "role": "human2",
        "content": "Yes, and it's dangerous because there is a death penalty for pink creatures (for some reason..)"
      },
      {
        "role": "human1",
        "content": "Yes, and it really upset him because he is a scion of a line of pink and respectable cats"
      },
      {
        "role": "human2",
        "content": "Yes, and his pink family also had a significant part in the exodus from Egypt"
      },
      {
        "role": "human1",
        "content": "Yes, and the famous pink dish of the holiday is named after them"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 151
  },
  {
    "id": "HH_105",
    "messages": [
      {
        "role": "human1",
        "content": "Two weeks ago we were in Rome"
      },
      {
        "role": "human2",
        "content": "Hello"
      },
      {
        "role": "human1",
        "content": "Yes and we walked a lot"
      },
      {
        "role": "human2",
        "content": "Yes, and then we just started flying from place to place"
      },
      {
        "role": "human1",
        "content": "Yes and we went through all the places above all until we saw something really crazy"
      },
      {
        "role": "human2",
        "content": "Yes and we had to go down and see what it was"
      },
      {
        "role": "human1",
        "content": "Yes and it was really colorful with and tall that made weird noises"
      },
      {
        "role": "human2",
        "content": "Yes and we tried to get closer and touch it"
      },
      {
        "role": "human1",
        "content": "Yes and it was passing an electric current"
      },
      {
        "role": "human2",
        "content": "Yes and it was a little painful but also a little pleasant"
      },
      {
        "role": "human1",
        "content": "Yes and we really wanted to stay longer"
      },
      {
        "role": "human2",
        "content": "Yeah and then we remembered we have an ice skating competition next week"
      },
      {
        "role": "human1",
        "content": "Yes and immediately we started flying back to Brazil"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 127
  },
  {
    "id": "HH_106",
    "messages": [
      {
        "role": "human1",
        "content": "The trip to Mars last week was crazy!"
      },
      {
        "role": "human2",
        "content": "Yes, it was great. Remember we were looking for water and we didn't succeed?"
      },
      {
        "role": "human1",
        "content": "Yes, and then when we realized at the end that our pesticide is actually more satiating and nutritious than water and we started drinking endlessly it did not do well"
      },
      {
        "role": "human2",
        "content": "Yes, luckily we found this branch of McDonald's and ate chicken nuggets from Mars"
      },
      {
        "role": "human1",
        "content": "Yes, and it still hasn't dawned on me that the birds on Mars don't have wings at all, do you remember what they had instead? My memory was erased when we got back"
      },
      {
        "role": "human2",
        "content": "You must remember! They have another simple pair of ears. I managed to escape from the memory wipe position"
      },
      {
        "role": "human1",
        "content": "Yes! And how did you do it? No... an Ashkenazi like me always falls in the selection"
      },
      {
        "role": "human2",
        "content": "Oh it's very simple, I told them I don't remember my name so they assumed someone had already deleted me."
      },
      {
        "role": "human1",
        "content": "Say, are you coming for a trip to Uranus next week?"
      },
      {
        "role": "human2",
        "content": "I can't, I promised Gal and Idan that I would help them write some simple application where you can write stories in the style of \"yes and\" together, but you don't mind a bit... you know, flying there?"
      },
      {
        "role": "human1",
        "content": "Yes, I heard that the security situation there is not good.. There is some shelling there by the Plectron tribe.. Have you heard about the conflict there?"
      },
      {
        "role": "human2",
        "content": "Yeah... wow I'm so out of touch. Sorry for the delay. This conflict there is driving me crazy! How long does it take to solve something like this??"
      },
      {
        "role": "human1",
        "content": "It was magical bye :)\\"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 265
  },
  {
    "id": "HH_107",
    "messages": [
      {
        "role": "human1",
        "content": "Remember how she loves the sun?"
      },
      {
        "role": "human2",
        "content": "Yes, and since then I haven't stopped thinking about Aliyah"
      },
      {
        "role": "human1",
        "content": "And you told me that she even appears in your dreams.."
      },
      {
        "role": "human2",
        "content": "Yes and we decided to enter into one of these dreams"
      },
      {
        "role": "human1",
        "content": "Yes and everything was in bright colors and we jumped on clouds"
      },
      {
        "role": "human2",
        "content": "Yes and then we saw her fishing in a lake upside down"
      },
      {
        "role": "human1",
        "content": "Yes and she messed with the bait instead of putting a worm named unicorn hair"
      },
      {
        "role": "human2",
        "content": "Yes and then the sun emerged from the clouds"
      },
      {
        "role": "human1",
        "content": "Yes, and she had the face of the televizz"
      },
      {
        "role": "human2",
        "content": "Yes and she said \"Wow, how I love the sun\""
      },
      {
        "role": "human1",
        "content": "Yes, and then she invited Lido to the stage!"
      },
      {
        "role": "human2",
        "content": "Yes and we did a rap battle and I dropped sick beats all over the stage"
      },
      {
        "role": "human1",
        "content": "Yes, and then Lidui said to you, brother Tanya danger, I'm doing you with a bird, brother, at night-kitana"
      },
      {
        "role": "human2",
        "content": "Yes, and I told him \"Leave you from superlatives\" and he started to cry"
      },
      {
        "role": "human1",
        "content": "Yes and then threw the mike and left"
      },
      {
        "role": "human2",
        "content": "You're Mick and the microphone is Mick so funny"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 181
  },
  {
    "id": "HH_108",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we went to the beach and it was really hot?"
      },
      {
        "role": "human2",
        "content": "Yes, and we ate a lot of sand and it was delicious"
      },
      {
        "role": "human1",
        "content": "Yes, and then the cancer will get stuck between your teeth"
      },
      {
        "role": "human2",
        "content": "Yes and then he tried to go back to the sea"
      },
      {
        "role": "human1",
        "content": "Yes and how lucky I was to catch him and put him on the fire"
      },
      {
        "role": "human2",
        "content": "Yes and then we drove home and brought grilled crabs for your whole family"
      },
      {
        "role": "human1",
        "content": "Yes and then we invited your family too"
      },
      {
        "role": "human2",
        "content": "Yes, and then my mother said we would add some tahini because it came out a little dry"
      },
      {
        "role": "human1",
        "content": "Yes and then we had to find a lemon for the tahini"
      },
      {
        "role": "human2",
        "content": "Yes, and then I said that no one puts lemon in the tahini"
      },
      {
        "role": "human1",
        "content": "Yes, and then I answered that lemon adds a lot"
      },
      {
        "role": "human2",
        "content": "Yes and then I said that if life brings lemons you should make lemonade out of them, so we made lemonade"
      },
      {
        "role": "human1",
        "content": "Yes, and then we opened a stand and sold lemonades to finance the fanjoya"
      },
      {
        "role": "human2",
        "content": "Yes, and then the booth was better than Haymon Limon"
      },
      {
        "role": "human1",
        "content": "Yes, and then we started selling the egg protein as well, because it's better than a lemon"
      },
      {
        "role": "human2",
        "content": "Yes, protein first"
      },
      {
        "role": "human1",
        "content": "Yes and yolk is just bad"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 18,
    "num_words": 208
  },
  {
    "id": "HH_109",
    "messages": [
      {
        "role": "human1",
        "content": "Remember last week when we went skydiving?"
      },
      {
        "role": "human2",
        "content": "yes, I broke my leg there"
      },
      {
        "role": "human1",
        "content": "yes and we had to call a flying ambulance because you broke it in the air"
      },
      {
        "role": "human2",
        "content": "yes and the flying ambulance driver was a monkey"
      },
      {
        "role": "human1",
        "content": "yes and his wife was an elephant, you could see they loved each other very much"
      },
      {
        "role": "human2",
        "content": "yes but he cheated on her with me after they treated me"
      },
      {
        "role": "human1",
        "content": "yes and we went on a double date to a fancy restaurant"
      },
      {
        "role": "human2",
        "content": "yes and the whole restaurant was underwater"
      },
      {
        "role": "human1",
        "content": "yes and we gave a very big tip"
      },
      {
        "role": "human2",
        "content": "yes and afterwards we went skydiving again"
      },
      {
        "role": "human1",
        "content": "yes and a strong gust of wind took us to Paris"
      },
      {
        "role": "human2",
        "content": "yes and then we found out the monkey grew up in paris"
      },
      {
        "role": "human1",
        "content": "yes and together with the monkey we visited the city's zoo"
      },
      {
        "role": "human2",
        "content": "yes and then we met his family there"
      },
      {
        "role": "human1",
        "content": "yes and we had such a good time that his mom made us honorary monkeys"
      },
      {
        "role": "human2",
        "content": "yes and the elephant was very jealus becase they never liked her"
      },
      {
        "role": "human1",
        "content": "yes and we decided to run from Paris and go on vacation with the elephant"
      },
      {
        "role": "human2",
        "content": "yes and then we her parents in our vacation to thailand"
      },
      {
        "role": "human1",
        "content": "yes and we went skydiving"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 20,
    "num_words": 201
  },
  {
    "id": "HH_110",
    "messages": [
      {
        "role": "human1",
        "content": "How beautiful the sunset was yesterday"
      },
      {
        "role": "human2",
        "content": "Hey, what's going on? Remember two days ago we had a test?"
      },
      {
        "role": "human1",
        "content": "Yes and you didn't stop copying"
      },
      {
        "role": "human2",
        "content": "Yes, but I saw that you had time to take a look and copy"
      },
      {
        "role": "human1",
        "content": "Yes, like me, Neta and Static did it with zero effort"
      },
      {
        "role": "human2",
        "content": "Yeah but it really pissed me off, I really tried and invested and then the three of you just did it with zero effort, you didn't really care what they said"
      },
      {
        "role": "human1",
        "content": "Yes, and that's what I said to Benel - you are one of the few who are still doing it wrong"
      },
      {
        "role": "human2",
        "content": "Yes, but what really pissed me off is that I saw that you recorded her sitting on the sidelines and you didn't say anything to her, you know how much you influence her"
      },
      {
        "role": "human1",
        "content": "Yes, but I already told you once, I don't know what I want"
      },
      {
        "role": "human2",
        "content": "Yes, but I'm not worried about you, after all Noa Kila told you that you look like a million dollars, if she told you such a thing, you will succeed in life"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 11,
    "num_words": 180
  },
  {
    "id": "HH_111",
    "messages": [
      {
        "role": "human1",
        "content": "Remember a month ago when we visited a museum in New York?"
      },
      {
        "role": "human2",
        "content": "Yes, and we saw that she put the picture of the first Israeli who made falafel"
      },
      {
        "role": "human1",
        "content": "Yes, and the picture looked strange from a distance and when we got closer we saw that it was drawn in the mill"
      },
      {
        "role": "human2",
        "content": "Yes, and I didn't hold back and had to give a whish with my finger in order to taste the 74-year-old tahini, it was not bad at all, a little too lemony"
      },
      {
        "role": "human1",
        "content": "Yeah and then we found out you were allergic to lemon so we took you by helicopter to a hospital in Hawaii"
      },
      {
        "role": "human2",
        "content": "Yes and then after I recovered the insurance paid us for the hotel so we said come on let's fly on our trip and we went to the Von Moon party until the wee hours"
      },
      {
        "role": "human1",
        "content": "Yes, and we surfed between the different bar positions - at each one we took a different whip"
      },
      {
        "role": "human2",
        "content": "Yes, and suddenly we realized that we were upside down, so we decided to go on a hunting trip"
      },
      {
        "role": "human1",
        "content": "Yes, and we hunted the biggest mythical fish in the sea"
      },
      {
        "role": "human2",
        "content": "Yes and it tasted like chicken"
      },
      {
        "role": "human1",
        "content": "Yeah and then he got punched"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 12,
    "num_words": 201
  },
  {
    "id": "HH_112",
    "messages": [
      {
        "role": "human1",
        "content": "Remember a month ago when we visited the opera?"
      },
      {
        "role": "human2",
        "content": "Yes, and there was one in the audience who burst onto the stage"
      },
      {
        "role": "human1",
        "content": "Yes and that was our grandmother, we had to catch her"
      },
      {
        "role": "human2",
        "content": "Lucky I had the rope and cage on me"
      },
      {
        "role": "human1",
        "content": "Yes, and when we caught her we had to hide her out of shame"
      },
      {
        "role": "human2",
        "content": "Yes, and we put her in a tanker that was finally loaded on a ship to Brazil"
      },
      {
        "role": "human1",
        "content": "Yes, and it turns out that she is Princess Mario de Janeiro, so we were treated like kings"
      },
      {
        "role": "human2",
        "content": "Yes and then you were forced to marry the ugly princess or be executed"
      },
      {
        "role": "human1",
        "content": "Yes and I learned to love her because of the character, but her brother fell in love with you"
      },
      {
        "role": "human2",
        "content": "Yes and I tried to be sexually open and it didn't work so I killed him and blamed you"
      },
      {
        "role": "human1",
        "content": "Yes, and I was imprisoned and every night I sang you songs of my emotions"
      },
      {
        "role": "human2",
        "content": "Yes and then the thrill worked so I released you from prison"
      },
      {
        "role": "human1",
        "content": "Yes, and we started a rebellion against the monarchy, you were the chief general"
      },
      {
        "role": "human2",
        "content": "Yes and I appointed a Brazilian monkey as my lieutenant thanks to which we won the war"
      },
      {
        "role": "human1",
        "content": "Yes and as a sign of victory we had a party on the dark side of the moon, the monkey was the DJ"
      },
      {
        "role": "human2",
        "content": "×›×Ÿ ×•××– ×—×™×ª× ×• ××•×ª×• ×¢× ×”× ×¡×™×›×” ×”×ž×›×•×¢×¨×ª ×•×‘×—×¨× ×• ×œ×ž××“×™× âœŠ"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 17,
    "num_words": 235
  },
  {
    "id": "HH_113",
    "messages": [
      {
        "role": "human1",
        "content": "go ahad"
      },
      {
        "role": "human2",
        "content": "Remember 20 years ago when we ate ice cream?"
      },
      {
        "role": "human1",
        "content": "Yes and remember that there were only 3 options?"
      },
      {
        "role": "human2",
        "content": "yes and that wasn't enough for us so we made a 4th options - onions"
      },
      {
        "role": "human1",
        "content": "yes and you wanted white and I wanted red onion"
      },
      {
        "role": "human2",
        "content": "yes and we had a big fight that lasted for 10 years"
      },
      {
        "role": "human1",
        "content": "yes and I am glad we finally make up"
      },
      {
        "role": "human2",
        "content": "yes and just in time, a week before my daughters wedding"
      },
      {
        "role": "human1",
        "content": "yes and now when I think about it, this was not a coincidence"
      },
      {
        "role": "human2",
        "content": "yes and this is because you were always in love with my daughter"
      },
      {
        "role": "human1",
        "content": "you won the game."
      },
      {
        "role": "human2",
        "content": "LOL"
      },
      {
        "role": "human1",
        "content": ":)"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 110
  },
  {
    "id": "HH_114",
    "messages": [
      {
        "role": "human1",
        "content": "Saul"
      },
      {
        "role": "human2",
        "content": "Once upon a time there was a princess named Princess"
      },
      {
        "role": "human1",
        "content": "And she loved a guy named Prince"
      },
      {
        "role": "human2",
        "content": "Prince took her on a world tour"
      },
      {
        "role": "human1",
        "content": "When it was cold he played her Purple Rain and when it was hot he gave her a poo on her face"
      },
      {
        "role": "human2",
        "content": "Then she realized that she actually prefers the Foo Fighters in Blue Rain and went to America"
      },
      {
        "role": "human1",
        "content": "But when she found out that Dave Grohl was busy, she decided that she was going on a trip to Texas"
      },
      {
        "role": "human2",
        "content": "In Texas she found herself eating steak with BeyoncÃ© singing to Dolly Parton's Jolene"
      },
      {
        "role": "human1",
        "content": "She complimented BeyoncÃ© on the steak and she took her home and introduced her to Jay-Z"
      },
      {
        "role": "human2",
        "content": "JD explained to her that he has 99 problems but she is welcome to come with him to the park"
      },
      {
        "role": "human1",
        "content": "When they arrived at the park, a spectacular surprise was discovered!"
      },
      {
        "role": "human2",
        "content": "The continuation in the next chapter"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 13,
    "num_words": 153
  },
  {
    "id": "HH_115",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we made a hamburger in the improvisation workshop?"
      },
      {
        "role": "human2",
        "content": "Yes, and you were wearing Crocs"
      },
      {
        "role": "human1",
        "content": "Yes, and there was fur in them"
      },
      {
        "role": "human2",
        "content": "True blue"
      },
      {
        "role": "human1",
        "content": "Yes and I was really scared because I don't know who is talking to me"
      },
      {
        "role": "human2",
        "content": "Your cleaner said you were wearing crocs to keep from falling"
      },
      {
        "role": "human1",
        "content": "Yes and that they should not be put in the mall because it is caught in escalators"
      },
      {
        "role": "human2",
        "content": "Yes, I fell in the mall once on my nails"
      },
      {
        "role": "human1",
        "content": "Yes me too and then they broke"
      },
      {
        "role": "human2",
        "content": "Yes, so I changed the shape of the nails"
      },
      {
        "role": "human1",
        "content": "Yes me too and then I regretted it because Spitz is more beautiful"
      },
      {
        "role": "human2",
        "content": "And you can also hit with it right"
      },
      {
        "role": "human1",
        "content": "Yes, and now I want to order Zozobra"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 14,
    "num_words": 123
  },
  {
    "id": "HH_116",
    "messages": [
      {
        "role": "human1",
        "content": "Hello"
      },
      {
        "role": "human2",
        "content": "Hello"
      },
      {
        "role": "human1",
        "content": "Remember we ate ice cream by the sea?"
      },
      {
        "role": "human2",
        "content": "hey what did you do today"
      },
      {
        "role": "human1",
        "content": "Yes, it was delicious, what a special ice cream it was"
      },
      {
        "role": "human2",
        "content": "what is your favorite flavor"
      },
      {
        "role": "human1",
        "content": "You didn't understand my game"
      },
      {
        "role": "human2",
        "content": "just talking"
      },
      {
        "role": "human1",
        "content": "no no"
      },
      {
        "role": "human2",
        "content": "It is according to the form of yes and.."
      },
      {
        "role": "human1",
        "content": "Okay, so it's not like before"
      },
      {
        "role": "human2",
        "content": "OK from the start"
      },
      {
        "role": "human1",
        "content": "Now you're undermining me"
      },
      {
        "role": "human2",
        "content": "Hello"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 66
  },
  {
    "id": "HH_117",
    "messages": [
      {
        "role": "human1",
        "content": "Remember yesterday when we went to the zoo?"
      },
      {
        "role": "human2",
        "content": "Yes and then we saw monks"
      },
      {
        "role": "human1",
        "content": "Yes and the monks showed us how to peel bananas faster"
      },
      {
        "role": "human2",
        "content": "Yes and once we learned to peel the bananas we started a banana peeling business"
      },
      {
        "role": "human1",
        "content": "Yes and Calcalist made a post about us"
      },
      {
        "role": "human2",
        "content": "Yes and my mom sent me the post and was very proud of us"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 7,
    "num_words": 63
  },
  {
    "id": "HH_118",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we were kids and won the lottery?"
      },
      {
        "role": "human2",
        "content": "I remember once we climbed a mountain for the first time"
      },
      {
        "role": "human1",
        "content": "Yes, and we saw a really strange animal"
      },
      {
        "role": "human2",
        "content": "Yes, and she had a really big head"
      },
      {
        "role": "human1",
        "content": "Yes and she also had very big eyes"
      },
      {
        "role": "human2",
        "content": "Yes, and you are very scared"
      },
      {
        "role": "human1",
        "content": "Yes and I jumped aside and left you to deal with her alone"
      },
      {
        "role": "human2",
        "content": "Yes and there was no one around us"
      },
      {
        "role": "human1",
        "content": "Yes and then we thought how to make her like us"
      },
      {
        "role": "human2",
        "content": "Yes and you made her such a funny face of yours"
      },
      {
        "role": "human1",
        "content": "Yes and she started to approach us"
      },
      {
        "role": "human2",
        "content": "Yes, and then we saw that a tiger was sitting on a tree branch and watching us"
      },
      {
        "role": "human1",
        "content": "Yes and we realized that the only way to get out safely is to bring them some of our food"
      },
      {
        "role": "human2",
        "content": "Yes, and we took a sandwich out of the bag"
      },
      {
        "role": "human1",
        "content": "Yes, and we cut it in half so they wouldn't compete"
      },
      {
        "role": "human2",
        "content": "Yes, and then suddenly a flood began to fall"
      },
      {
        "role": "human1",
        "content": "Yes, and we didn't want to get wet, so we entered the cave together with the animals"
      },
      {
        "role": "human2",
        "content": "×›×Ÿ ×•×“×•×•×§× ×¨××™× ×• ×©×”× ×—×‘×¨×™×"
      },
      {
        "role": "human1",
        "content": "×›×Ÿ ×•×”×“×œ×§× ×• ×ž×“×•×¨×” ×›×“×™ ×œ×”×ª×—×ž×"
      },
      {
        "role": "human2",
        "content": "×›×Ÿ ×•×ž×¦×× ×• ×©×ž×™×©×”×• × ×ž×¦× ×‘×ž×¢×¨×”"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 21,
    "num_words": 200
  },
  {
    "id": "HH_119",
    "messages": [
      {
        "role": "human1",
        "content": "Hey wanna tell everyone the story of how we found and adopted a four-dimensional cat?"
      },
      {
        "role": "human2",
        "content": "Yes and remember how we chose him from all the animals in the four-dimensional zoo?"
      },
      {
        "role": "human1",
        "content": "Yes and it was a really tough decision, there was the adorable reversed giraffe"
      },
      {
        "role": "human2",
        "content": "Yes and I really liked the time traveling dog but you wouldn't let me adopt it"
      },
      {
        "role": "human1",
        "content": "Yes and I felt really bad for this, so much that I took us to a restaurant 10000 years in the future"
      },
      {
        "role": "human2",
        "content": "Yes and you drank the special \"Milkshake In Space\" when we got to Mars"
      },
      {
        "role": "human1",
        "content": "Yes! and now I remember that we met there travelers from another galaxy"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 8,
    "num_words": 110
  },
  {
    "id": "HH_120",
    "messages": [
      {
        "role": "human1",
        "content": "Remember when we hiked in the Alps and saw high mountains?"
      },
      {
        "role": "human2",
        "content": "Yes and suddenly we saw Zeus peeking out of the clouds"
      },
      {
        "role": "human1",
        "content": "Yes, and it really surprised us because he looked in the middle of the day and not at night as they say"
      },
      {
        "role": "human2",
        "content": "Yes, and we tried to tell him to relax a bit with the lightning, why is he exaggerating a bit"
      },
      {
        "role": "human1",
        "content": "Yes, and despite that, one of the lightnings hit you your bottle that you loved and you were terribly angry"
      },
      {
        "role": "human2",
        "content": "Yes and I thought out loud that maybe if I drank this water I would become a god myself"
      },
      {
        "role": "human1",
        "content": "Yes, and we wondered why specifically to God and not to these"
      },
      {
        "role": "human2",
        "content": "Yes, and little by little we began to doubt Zeus himself, maybe he is even a woman and he is just pretending"
      },
      {
        "role": "human1",
        "content": "Yes and then when he stopped with the lightning we continued to skip upside down on the path"
      },
      {
        "role": "human2",
        "content": "Yes and we put on our skis and skied back down the mountain"
      },
      {
        "role": "human1",
        "content": "Yes, and then you almost hit the cute healer who was picking twigs in the snow"
      },
      {
        "role": "human2",
        "content": "Yes and luckily he had springs instead of legs so he jumped high to avoid us"
      },
      {
        "role": "human1",
        "content": "Yes, and when we tried to buy such springs in the store, we were told that they are only sold in Tanzania in the spring"
      }
    ],
    "num_messages": 13,
    "num_words": 225
  },
  {
    "id": "HH_121",
    "messages": [
      {
        "role": "human1",
        "content": "Ami and Tami bought fireworks for Passover"
      },
      {
        "role": "human2",
        "content": "Yes, and then the seller said they were too old and suggested they buy diapers"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 3,
    "num_words": 23
  },
  {
    "id": "HH_122",
    "messages": [
      {
        "role": "human1",
        "content": "Exactly a week ago we were on the International Space Station"
      },
      {
        "role": "human2",
        "content": "Yes and there were a million aliens there"
      },
      {
        "role": "human1",
        "content": "Yeah and they were really weird"
      },
      {
        "role": "human2",
        "content": "Yes and we thought it would be funny to bully them"
      },
      {
        "role": "human1",
        "content": "Yeah so I pulled out my portable speaker"
      },
      {
        "role": "human2",
        "content": "Yes, and then he played songs on the speaker at full volume"
      },
      {
        "role": "human1",
        "content": "Yes, and I put Avi Bitter at full volume"
      },
      {
        "role": "human2",
        "content": "Yes, and then it turned out that Avi Bitar is really famous among them"
      },
      {
        "role": "human1",
        "content": "Yes and they all started singing and crying"
      },
      {
        "role": "human2",
        "content": "Yes and then we decided to join them in crying"
      },
      {
        "role": "human1",
        "content": "Yes and we hugged and cried and everyone was very excited"
      },
      {
        "role": "human2",
        "content": "Yes, and then we realized that they were organizing a trip to Mars"
      },
      {
        "role": "human1",
        "content": "Yes and we said wow a dream to smoke something with aliens on Mars"
      },
      {
        "role": "human2",
        "content": "Yes and then I said there is no way because I am not their friend"
      },
      {
        "role": "human1",
        "content": "Yes and I asked her if even for a million dollars she wouldn't do it?"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 16,
    "num_words": 166
  },
  {
    "id": "HH_123",
    "messages": [
      {
        "role": "human1",
        "content": "Do you remember when we jumped into the sea and it was empty?"
      },
      {
        "role": "human2",
        "content": "Yes and we waited straight and suddenly we were at the entrance to heaven"
      },
      {
        "role": "human1",
        "content": "Yes and we were received really nicely, and Miri Masika sang in the background and then went back to her house"
      },
      {
        "role": "human2",
        "content": "Yes, and all the time there were waiters who served delicious appetizers of things we hadn't eaten until today"
      },
      {
        "role": "human1",
        "content": "Yes and there was no feeling of satiety, we ate non-stop for hours"
      },
      {
        "role": "human2",
        "content": "Yes, and we were so full that we had to find a place to sleep"
      },
      {
        "role": "human1",
        "content": "Yes, and we found the Tree of Knowledge and went to sleep under it"
      },
      {
        "role": "human2",
        "content": "And then an apple fell on you"
      },
      {
        "role": "human1",
        "content": "Yes, and then Newton came and together we discovered a new element of gravity"
      },
      {
        "role": "human2",
        "content": "Yes, and we called him Bozonson. And Newton also told us that he did not discover gravity at all"
      },
      {
        "role": "human1",
        "content": "Yes and then all the scientists came to hear the gossip"
      },
      {
        "role": "human2",
        "content": "Yes, and suddenly we felt disconnected, lucky that Galileo was a man and offered us a beer"
      },
      {
        "role": "human1",
        "content": "Yes, and then at the bar Gabriel the angel joined, what a handsome man he is"
      },
      {
        "role": "human2",
        "content": "Yes and it annoyed me, because there was someone I wanted and she was around him all the time"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 15,
    "num_words": 213
  },
  {
    "id": "HH_124",
    "messages": [
      {
        "role": "human1",
        "content": "remember when we worked in the super market?"
      },
      {
        "role": "human2",
        "content": "yes and the manager hated us"
      },
      {
        "role": "human1",
        "content": "yes and we made a deal with the devil - he makes the boss like us and we give him our car"
      },
      {
        "role": "human2",
        "content": "yes and that was a very good deal because the car didn't work"
      },
      {
        "role": "human1",
        "content": "yes and the boss liked us so much he made us CEOs of the chain"
      },
      {
        "role": "human2",
        "content": "yes and we had to split the chain evenly so we won't fight"
      },
      {
        "role": "human1",
        "content": "yes and that is why every store has a line in the middle to separate the two chains"
      },
      {
        "role": "human2",
        "content": "yes and the customers voted it was the best buisness idea ever"
      },
      {
        "role": "human1",
        "content": "yes and we made a branch in every big city in the world and one in a secret city no one has ever heard about"
      },
      {
        "role": "human2",
        "content": "yes and the only customers in the secret city were carb-people"
      },
      {
        "role": "human1",
        "content": "yes and we worked with the government to make peace with the carb-people (but secretly also a war)"
      },
      {
        "role": "human2",
        "content": "yes and the crab people were very shell-fish so it didn't work"
      },
      {
        "role": "human1",
        "content": "yes and we grew old and went to a retirement home"
      },
      {
        "role": "human2",
        "content": "yes and there we got married to the attending nurses"
      },
      {
        "role": "human1",
        "content": "yes and we kissed them and they became frogs"
      },
      {
        "role": "human2",
        "content": "yes and the frogs went and joined the carb-people in the secret city"
      },
      {
        "role": "human1",
        "content": "yes and we followed them, this time with an army"
      },
      {
        "role": "human2",
        "content": "yes and we won the war and the world was finally cancer free"
      },
      {
        "role": "human1",
        "content": "________________"
      }
    ],
    "num_messages": 19,
    "num_words": 240
  },
  {
    "id": "HH_125",
    "messages": [
      {
        "role": "human1",
        "content": "Hi yes"
      },
      {
        "role": "human2",
        "content": "Are you yesman?"
      },
      {
        "role": "human1",
        "content": "Maga"
      },
      {
        "role": "human2",
        "content": "Moga*"
      },
      {
        "role": "human1",
        "content": "Shalom"
      },
      {
        "role": "human2",
        "content": "Remember when we made a human bonfire?"
      },
      {
        "role": "human1",
        "content": "Yes and then there was a smell of burnt chicken"
      },
      {
        "role": "human2",
        "content": "Yes, and then we made electric sauce"
      },
      {
        "role": "human1",
        "content": "Yes, and then we invited the whole village to eat"
      },
      {
        "role": "human2",
        "content": "Yes, that is, those who remained from the village"
      },
      {
        "role": "human1",
        "content": "Of those who were not in the Yaani fire"
      },
      {
        "role": "human2",
        "content": "Yes, and we uploaded the rest in the seance"
      },
      {
        "role": "human1",
        "content": "Yes, it was really cool, and then Uncle Topaz's spirit rose"
      },
      {
        "role": "human2",
        "content": "Yes I remember and then he also told jokes"
      },
      {
        "role": "human1",
        "content": "Yes and no one laughed at them"
      },
      {
        "role": "human2",
        "content": "Yes and we brought him back to the dead because of it"
      },
      {
        "role": "human1",
        "content": "Yes, he shouted like that: because my jokes are not funny, I decided to kill myself, so I kill myself again"
      },
      {
        "role": "human2",
        "content": "Marvin"
      },
      {
        "role": "human1",
        "content": "Yes and no one tried to stop him"
      },
      {
        "role": "human2",
        "content": "Yes, everyone was fine with it"
      },
      {
        "role": "human1",
        "content": "Yes and then after that we had an after party at the chief's house"
      },
      {
        "role": "human2",
        "content": "Yes and then his daughter got drunk I tried to flush her"
      },
      {
        "role": "human1",
        "content": "Yes I remember and then you burned it after it didn't flow"
      },
      {
        "role": "human2",
        "content": "yes and her father helped me remember?"
      },
      {
        "role": "human1",
        "content": "Sure I remember and he also asked us to take her brother too because he was useless"
      },
      {
        "role": "human2",
        "content": "Yes, we really rescued this village from all their boating"
      },
      {
        "role": "human1",
        "content": "Then we went to the village opposite"
      },
      {
        "role": "human2",
        "content": "________________"
      }
    ],
    "num_messages": 28,
    "num_words": 224
  },
  {
    "id": "HH_126",
    "messages": [
      {
        "role": "human1",
        "content": "HELP"
      },
      {
        "role": "human2",
        "content": "I remember that we chose Maharat Borax"
      },
      {
        "role": "human1",
        "content": "Yes, and then I went to the freak shop in Chinter"
      },
      {
        "role": "human2",
        "content": "Yes, and then I went to the freak shop in Chinter"
      },
      {
        "role": "human1",
        "content": "Yes, and you bought me a bracelet full of spikes"
      },
      {
        "role": "human2",
        "content": "Yes, and people were afraid to stand near you"
      },
      {
        "role": "human1",
        "content": "Yes, and I decided that this is a power that I should take advantage of"
      },
      {
        "role": "human2",
        "content": "Yes, and then you decided to stab everyone you don't see"
      },
      {
        "role": "human1",
        "content": "And no one is crazy, except you of course"
      },
      {
        "role": "human2",
        "content": "Yes and then I was afraid I was next in line so I stole your bracelet"
      },
      {
        "role": "human1",
        "content": "Yes, and then the bracelet gave you superpowers and you started flying and shooting lasers from your eyes"
      },
      {
        "role": "human2",
        "content": "Yes, and it wasn't just any laser either, it was a bolt of cookies"
      },
      {
        "role": "human1",
        "content": "Yes, and I was also so hungry that I approached a cookie jar and got burned"
      },
      {
        "role": "human2",
        "content": "Yes and that's why we spent the whole night in a hospital for laser beam victims smelling like cookies"
      },
      {
        "role": "human1",
        "content": "Yes, and in fact they came from the newspaper because we opened the first department ever in the world for cookie fund victims"
      },
      {
        "role": "human2",
        "content": "Yes, and then we went beating who would be on the cover of the newspaper"
      },
      {
        "role": "human1",
        "content": "Yes and you were still with the bracelet but I was with the pendant I found"
      },
      {
        "role": "human2",
        "content": "Yes, and I don't remember what form it was anymore"
      },
      {
        "role": "human1",
        "content": "Yes and he didn't really bring me superpowers and that frustrated me"
      },
      {
        "role": "human2",
        "content": "Yes, and I thought only I had superpowers"
      },
      {
        "role": "human1",
        "content": "Yes and I kept telling you that we should share"
      },
      {
        "role": "human2",
        "content": "Yes and that's why we haven't spoken since"
      },
      {
        "role": "human1",
        "content": "Yes, and then I didn't understand who I was talking to now"
      },
      {
        "role": "human2",
        "content": "Yes and I said I have a robot that does everything for me"
      },
      {
        "role": "human1",
        "content": "Yes, and then the god of time came and was angry with me for slapping the sentence in past and present tenses"
      }
    ],
    "num_messages": 25,
    "num_words": 316
  },
  {
    "id": "HH_127",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that one night we decided to go to Eilat?"
      },
      {
        "role": "human2",
        "content": "Yes, and we took your father's lighter"
      },
      {
        "role": "human1",
        "content": "Yes, and then when we arrived in Eilat we said pack-it, Delkan, we will go to Sinai"
      }
    ],
    "num_messages": 3,
    "num_words": 34
  },
  {
    "id": "HH_128",
    "messages": [
      {
        "role": "human1",
        "content": "Remember that time we flew to Greece?"
      },
      {
        "role": "human2",
        "content": "Yes, and we participated in the world championship in freestyle swimming"
      },
      {
        "role": "human1",
        "content": "Yes and there was also a group of seals  participating"
      },
      {
        "role": "human2",
        "content": "Yes and we had no chance of beating them, so we preferred to go to the beach instead"
      },
      {
        "role": "human1",
        "content": "Yes, and we met your mother on the beach"
      },
      {
        "role": "human2",
        "content": "Yes and she was surprised to see me with you, she thought we broke up"
      },
      {
        "role": "human1",
        "content": "Yes and I didn't even know we were together. And she was so angry that she slapped me hard"
      },
      {
        "role": "human2",
        "content": "Yes and then out of nowhere Greece on the beach jumped to your defense"
      },
      {
        "role": "human1",
        "content": "Yes, and then her friend came and started breaking plates like in a tavern"
      },
      {
        "role": "human2",
        "content": "Yes and Eden Ben Zaken started singing there"
      },
      {
        "role": "human1",
        "content": "Yes, and then we ran away"
      }
    ],
    "num_messages": 11,
    "num_words": 131
  },
  {
    "id": "HH_129",
    "messages": [
      {
        "role": "human1",
        "content": "A week ago I was at the beach"
      },
      {
        "role": "human2",
        "content": "Yes and there was the guy who sells popsicles"
      },
      {
        "role": "human1",
        "content": "Yes and I really wanted a watermelon popsicle and he didn't have any"
      },
      {
        "role": "human2",
        "content": "Yes and he said he only had a watermelon which was not a popsicle"
      },
      {
        "role": "human1",
        "content": "Yes and I took the watermelon and threw it on the floor"
      },
      {
        "role": "human2",
        "content": "Yes and then he started crying and shouting"
      },
      {
        "role": "human1",
        "content": "Yes, and then we tried to comfort him and tell him that everything would be fine"
      },
      {
        "role": "human2",
        "content": "Yes, and then we found out that it was all actually a reality show"
      },
      {
        "role": "human1",
        "content": "Yes, and then Yigal Shilon came out of the sand and pointed at a lot of cameras"
      },
      {
        "role": "human2",
        "content": "Yes and he gave out a full watermelon popsicle to everyone for free"
      },
      {
        "role": "human1",
        "content": "Yes and then a lot of boys and girls in swimsuits started dancing around us"
      }
    ],
    "num_messages": 11,
    "num_words": 139
  },
  {
    "id": "HH_130",
    "messages": [
      {
        "role": "human1",
        "content": "Remember we were on a cruise together?"
      },
      {
        "role": "human2",
        "content": "Yes, and then there was a whale"
      },
      {
        "role": "human1",
        "content": "Yeah and then the whale flipped our ship"
      },
      {
        "role": "human2",
        "content": "Then we got stuck in an iceberg"
      },
      {
        "role": "human1",
        "content": "Yes, and then we lost consciousness and it seems to me that we stepped on some kind of plank"
      },
      {
        "role": "human2",
        "content": "Then we saw that the name of the ship was the Titanic"
      },
      {
        "role": "human1",
        "content": "Yes and then slowly we drifted towards the beach"
      },
      {
        "role": "human2",
        "content": "Then a turtle hitchhiked us"
      },
      {
        "role": "human1",
        "content": "Yes, and then the turtle enters another turtle"
      },
      {
        "role": "human2",
        "content": "Yes and then they exchanged details"
      },
      {
        "role": "human1",
        "content": "hahahahaha"
      },
      {
        "role": "human2",
        "content": "LOL"
      },
      {
        "role": "human1",
        "content": "Yes and then it was very fun in the experience"
      }
    ],
    "num_messages": 13,
    "num_words": 100
  },
  {
    "id": "HH_131",
    "messages": [
      {
        "role": "human1",
        "content": "Remember Bennett said there is no more voice in the country"
      },
      {
        "role": "human2",
        "content": "Yes and I wanted to commit suicide"
      },
      {
        "role": "human1",
        "content": "Yes and I told you that you shouldn't because you haven't collected all the pokemons"
      },
      {
        "role": "human2",
        "content": "Yes and then I flew really far to look for them"
      },
      {
        "role": "human1",
        "content": "Yes, and you decided that you really wanted to start eating them"
      },
      {
        "role": "human2",
        "content": "Yes and it suddenly tasted like coke and I started laughing"
      },
      {
        "role": "human1",
        "content": "Yes, and then Bennett came and decided to confiscate all your Pokemon"
      },
      {
        "role": "human2",
        "content": "Yeah and then I called all the Marvel superheroes to come save the day"
      },
      {
        "role": "human1",
        "content": "Yes and Bennett attacked them with a lightning strike"
      },
      {
        "role": "human2",
        "content": "Yeah and then Captain America drowned him in a giant pool of coke"
      },
      {
        "role": "human1",
        "content": "Yes, and his little dome floated on the surface of the gases"
      },
      {
        "role": "human2",
        "content": "Yes, and then your mother suddenly arrived and started shouting"
      },
      {
        "role": "human1",
        "content": "Yes, and then we found out that it was all a dream because it is Seder night in Safed in 2004"
      },
      {
        "role": "human2",
        "content": "Yes, and then Veva came and started getting drunk"
      },
      {
        "role": "human1",
        "content": "Yes, and then Gal stopped the call"
      }
    ],
    "num_messages": 15,
    "num_words": 174
  }
]